[{"url": "http://www.cnet.com/products/sennheiser-momentum-wireless/", "sitename": "Cnet", "datetime": "2015-04-17T15:20:00-0700", "body": "In the last few months, Sennheiser's been blowing out the original version of its highly regarded Momentum headphones, selling them for less than $200 online after starting them out at $379 a couple of years ago. The reason for the price drop is that the company has new over-ear and on-ear Momentums, including new wireless models.(Confusingly, the new wired models are called the Momentum 2.0, while the wireless models seem to use the \"2.0\" label at some retailers, but not at others.)Not surprisingly, the new models don't come cheap. The over-ear Momentum 2.0 Wireless we're reviewing here carries a list price of $500 or £380 (that's AU$745 converted), which is probably about $100 more than it should cost. But aside from that pricing issue, it's a great Bluetooth headphone.View full gallery (16 Photos)The Momentum Wireless has larger earcups and is more comfortable than the original Momentum. Sarah Tew/CNET What's great about it? For starters, it's comfortable and well built. Sennheiser has tweaked the designs of both its Momentum over-ear and on-ear models. Both the wired and wireless versions have a new folding design that gives the headphones a slightly smaller footprint when they're in their included carrying case.In the case of the new wired Momentum 2.0 and this wireless model, Sennheiser has made the earcups a little bigger so they fit over your ears better and don't pinch anything (some users complained that the headphones were too small, sort of in between on on-ear and over-ear headphone). The designers also made the earcups softer.On top of its Bluetooth capabilities (it uses Bluetooth 4.0), the Momentum Wireless also features active noise cancellation and near-field communications tap-to-pair technology for compatible devices, and supports the aptX codec (aptX is supposed to improve the sound when streaming over Bluetooth). Additionally, you can attach a cable and use the headphone as a wired headphone. Not only does it sound better in this mode, but it plays louder. View full gallery (16 Photos)The headphones, which come in black or ivory, now have a folding design. Sarah Tew/CNET The playback and volume controls, as well as the power on/off button, are on the right earcup, and I was able to operate everything easily enough just by feel.Like a lot of other Bluetooth headphones and speakers, this model has some built-in voice prompts delivered by a soothing female voice. She tells you when the headphones are powered on or off, let's you know when your headphones are paired with your Bluetooth-enabled device (yes, these headphones work with iOS, Android, and Windows phones), and alerts you when your battery is low.Wireless range is the typical 33 feet or 10 meters and my wireless connection was mostly rock steady, though you will run into a bit of Bluetooth interference now and again. (Some reviewers on Amazon have complained of this.)The noise cancellation, which isn't too heavy, is always on -- there's no switch to turn it off -- but battery life is still quite good at up to 22 hours. The noise-canceling worked well in the streets of New York, and the integrated microphone, which is actually dual mics, worked very well for making calls with my cell phone. You can hear your own voice as you talk inside the headphones, which keeps you from talking louder than you need to.", "title": "Premium wireless sound for a premium price"},
{"url": "http://www.cnet.com/products/sony-mdr-1a/", "sitename": "Cnet", "datetime": "2015-04-16T11:10:00-0700", "body": "Sony's MDR-1A is the successor to the discontinued MDR-1R, a \"premium\" over-ear that we liked a lot when we reviewed it a few years ago.That earlier model was known for being extremely comfortable, and the very similar looking 1A, which costs $300 (£170 UK, AU$400), is even more so, thanks to some small design changes. First, its earcup design is subtly different, with softer padding and cushions that are slightly angled to conform to your head better. The finish on the MDR-1A is also a bit more textured (stippled). It's a minor detail, but I did like it slightly better, but others may prefer the smooth finish of the MDR-1R.One of the biggest design changes is that the MDR-1A's earcups rotate in an opposite direction from the MDR-1R's. That's a big deal because the headphones can now rest flat (pads down) against your clavicles when you have them sitting on your neck. In other words, they feel a lot more comfortable when you're wearing them around your neck and not listening to them.Enlarge ImageWhat you get in the box. Sarah Tew/CNET At 7.94 ounces (225 grams) without the cable attached, the MDR-1A is also slightly lighter than the MDR-1R (240 grams), which was already considered lightweight for an over-ear model. The headphone fits snugly but not too snugly and should fit a variety of head sizes well.The other small design change is to the cable connector on the headphones. On the MDR-1A, the base of the connector is plated with a gold ring. No such ring exists on the MDR-1R.In terms of accessories, you get two standard length 1.2-meter cables, one of which has a one-button inline remote and microphone. It's geared toward Android phones but also works with iPhones, though in a more limited capacity (no volume controls). If you have Android phone, you can use the free SmartKey app to customize the button controls.A decent carrying pouch is also included and Sony also sells three optional higher end cables for this headphone if you want to try to eke out even better sound.Enlarge ImageThe headphones look very similar to the MDR-1R, but have some small design changes, including a slightly more textured finish and even more comfortable earpads. Sarah Tew/CNET ", "title": "An already excellent over-ear headphone gets some small but key upgrades"},
{"url": "http://www.cnet.com/products/wren-v5us/", "sitename": "Cnet", "datetime": "2015-04-15T09:43:00-07002015-04-15T09:43:00-0700", "body": " Wren The V5US speaker is Wren's new flagship speaker which incorporates the capabilities of all three existing models -- V5AP, V5BT and V5PF -- plus forthcoming support for Spotify Connect with streaming directly from the Spotify app.TheV5US speaker looks almost identical to the previous models with a real wood veneer and curving MDF cabinet. The main difference is the two new finishes: black Wenge and the bamboo-like Anigre.The device offers Wi-Fi connectivity (for AirPlay, Spotify Connect and Play-Fi), Bluetooth, USB and a 3.5mm auxiliary port. There is no Ethernet port.By incorporating all four technologies, the device is possibly the most agnostic on the market, but unfortunately you'll pay for the privilege. While the existing models retail for $249 to $299, the new version is twice that at $499.If you're looking to get Spotify Connect and want the option of incorporating Play-Fi (best for streaming PC audio), then the V5PF at $299 is potentially a much better deal.Look for a full review of the V5US very soon.Updated, 9:43 p.m. PT:Wren advises that the existing models are being phased out and these will soon relaunch with new pricing between $379 and $399. Though there are no new details on what the differences will be, if you want the cheaper prices you should get in quick.", "title": "Wren V5US speaker offers universal wireless compatibility: AirPlay, Bluetooth and Spotify Connect"},
{"url": "http://www.cnet.com/products/philips-shoqbox-mini/", "sitename": "Cnet", "datetime": "2015-05-07T15:19:00-0700", "body": "The Philips Shoqbox Mini is a small, water-resistant Bluetooth speaker that reinforces the company's commitment to high quality portable audio products, as we've seen in the past with the older Philips Shoqbox SB700 and the Philips Dot.Unlike those products, however, the $60 (£40) Shoqbox Mini is rated to the IPX6 waterproofing standard that protects it from light splashes and rain. There's a loop on its base for a lanyard or dongle and it also happens to float, making it ideal for music fans looking to add a soundtrack to a pool party or even in the bathroom.For such a small device, it reaches impressively loud volumes with relative clarity (Bluetooth limitations notwithstanding) thanks to an internal limiter circuit that prevents the sound from distorting. You probably won't use it to power your next house party, but as a personal speaker it deserves our recommendation.A few people in the office commented that the Shoqbox Mini bears resemblance to a hand grenade, but I'm not sure an explosive device would be my first comparison. I can see where they're coming from, though -- its compact form and oval design with a knurled speaker grille fits easily into your hand.View full gallery (7 Photos) Sarah Tew/CNET The speaker weighs just 7 ounces (200 grams) and measures 4.2 by 2.3 by 2.7 inches (107x58x69mm). The build materials feel very capable of surviving the elements (more on that later), and a set of rubber feet on the bottom show that it's designed to sit horizontally with a rubberized set of media controls on one side (including separate power and volume) and a water-resistant gasket on the other that opens to reveal a Micro-USB and a 3.5mm auxiliary port underneath.View full gallery (7 Photos) Sarah Tew/CNET A 1.6-inch dual-firing driver lives inside that can pull up to 2.8 watts of power out of the speaker, and you have two options for connecting it to a source. You can either plug a hard wired 3.5-inch cable into the auxiliary port or you can pair it wirelessly via Bluetooth by simply holding down the pair button and selecting the Shoqbox Mini on your music player. It also has a microphone built into the unit so you can use it for conference calls.View full gallery (7 Photos) Sarah Tew/CNET The only critique worth mentioning here is that the speaker doesn't have an integrated auxiliary cable. Other speakers like the JBL clip make it easy for non-Bluetooth devices to play music with this feature, but it seems the trade-off here is that you get extra durability with IPX certification instead.The Shoqbox Mini is rated at the IPX6 ruggedness standards, which means it's not completely waterproof, though it can certainly survive drips of water, rain or some sprinkles of shower water if you want to add a soundtrack to your bathroom routine.", "title": "This compact Bluetooth speaker makes a big splash"},
{"url": "http://www.cnet.com/pictures/youre-using-your-refrigerator-wrong-pictures/", "sitename": "Cnet", "datetime": "April 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDT", "body": "", "title": ""},
{"url": "http://www.cnet.com/pictures/youre-using-your-refrigerator-wrong-pictures/", "sitename": "Cnet", "datetime": "April 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDT", "body": "", "title": ""},
{"url": "http://www.cnet.com/products/philips-shoqbox-mini/", "sitename": "Cnet", "datetime": "2015-05-07T15:19:00-0700", "body": "The Philips Shoqbox Mini is a small, water-resistant Bluetooth speaker that reinforces the company's commitment to high quality portable audio products, as we've seen in the past with the older Philips Shoqbox SB700 and the Philips Dot.Unlike those products, however, the $60 (£40) Shoqbox Mini is rated to the IPX6 waterproofing standard that protects it from light splashes and rain. There's a loop on its base for a lanyard or dongle and it also happens to float, making it ideal for music fans looking to add a soundtrack to a pool party or even in the bathroom.For such a small device, it reaches impressively loud volumes with relative clarity (Bluetooth limitations notwithstanding) thanks to an internal limiter circuit that prevents the sound from distorting. You probably won't use it to power your next house party, but as a personal speaker it deserves our recommendation.A few people in the office commented that the Shoqbox Mini bears resemblance to a hand grenade, but I'm not sure an explosive device would be my first comparison. I can see where they're coming from, though -- its compact form and oval design with a knurled speaker grille fits easily into your hand.View full gallery (7 Photos) Sarah Tew/CNET The speaker weighs just 7 ounces (200 grams) and measures 4.2 by 2.3 by 2.7 inches (107x58x69mm). The build materials feel very capable of surviving the elements (more on that later), and a set of rubber feet on the bottom show that it's designed to sit horizontally with a rubberized set of media controls on one side (including separate power and volume) and a water-resistant gasket on the other that opens to reveal a Micro-USB and a 3.5mm auxiliary port underneath.View full gallery (7 Photos) Sarah Tew/CNET A 1.6-inch dual-firing driver lives inside that can pull up to 2.8 watts of power out of the speaker, and you have two options for connecting it to a source. You can either plug a hard wired 3.5-inch cable into the auxiliary port or you can pair it wirelessly via Bluetooth by simply holding down the pair button and selecting the Shoqbox Mini on your music player. It also has a microphone built into the unit so you can use it for conference calls.View full gallery (7 Photos) Sarah Tew/CNET The only critique worth mentioning here is that the speaker doesn't have an integrated auxiliary cable. Other speakers like the JBL clip make it easy for non-Bluetooth devices to play music with this feature, but it seems the trade-off here is that you get extra durability with IPX certification instead.The Shoqbox Mini is rated at the IPX6 ruggedness standards, which means it's not completely waterproof, though it can certainly survive drips of water, rain or some sprinkles of shower water if you want to add a soundtrack to your bathroom routine.", "title": "This compact Bluetooth speaker makes a big splash"},
{"url": "http://www.cnet.com/pictures/youre-using-your-refrigerator-wrong-pictures/", "sitename": "Cnet", "datetime": "April 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDT", "body": "", "title": ""},
{"url": "http://www.cnet.com/pictures/youre-using-your-refrigerator-wrong-pictures/", "sitename": "Cnet", "datetime": "April 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDT", "body": "", "title": ""},
{"url": "http://www.cnet.com/products/canon-eos-m3/", "sitename": "Cnet", "datetime": "2015-05-04T13:15:00-0700", "body": " Canon's M3, the company's most recent foray into the growing mirrorless ILC market, is its most promising. Canon's first entry, 2012's EOS M, had widely-reported autofocus issues that turned off many customers before a firmware update addressed the problem. Its successor, the EOS M2, was only released in Japan and China. The third in the series looks to overcome the stumbling blocks of its predecessors, but the real question is whether the M3's respectable specs and DSLR-quality snapshots can make up for its lacklustre lineup of dedicated lenses, and a lesser feature set than closely priced competitors. The M3 is available in the European and Australian markets (while the US remains noticeably absent). Price-wise, the UK and Europe are looking to pay £600 or €770, while Australians can find it for around AU$900 for the kit with the 18-55mm IS STM lens.Image quality Image quality is as good as any of Canon's high-end APS-C DSLRs. Even with a 24.2-megapixel sensor, the camera does a very good job of controlling noise. Colours show good saturation and sharpness at such high resolutions. Most would rarely need all that extra resolution but it does allow a lot of latitude for cropping if the composition was a little off. More than likely though you'll find it comes in handy for cropping subjects because your zoom lens just doesn't reach far enough.Samples Canon EOS M3 sample photos See full gallery 1 - 2 / 8 Next Prev The M-mount 18-55mm IS STM lens that comes with the kit is a solid offering. Like most consumer kit lenses, it doesn't offer a very wide constant aperture at f3.5-5.6. Lens distortion isn't bad by any measure and it handles aberrations well. Canon knows what it's doing with lens design and the 18-55mm IS lens performs well when coupled with the M3's sensor. Luckily performance is mostly up to par, since the camera relies on the 18-55mm as it's one of only four lenses available for the M-series mount. Enlarge ImageAt lower ISOs JPEGs hold up well Dave Cheng/CNET Enlarge ImageAt ISO 3200 onwards details degrade but images are very usable. Dave Cheng/CNET Enlarge ImageThe original framing for the test shots Dave Cheng/CNET Enlarge ImageWithout the EOS-EF M adapter and an EF mount Sigma 50mm f/1.4 Art lens this shot would not have been possible. Dave Cheng/CNET Coupled with the optional Mount Adapter EF-EOS M (roughly £99, AU$130) and Sigma's 50mm f/1.4 Art, the M3 was able to show off its low-light capabilities. Shooting at ISO 6400 produces usable night photos like the cat lit by a street light. It really highlights the strength of Canon's sensor when paired with a quality lens. JPEG processing emphasises bringing out additional detail in the shadows. Raw files display more contrast whereas the JPEGs aim for a more balanced exposure. There's also some mild noise reduction in the JPEGs that smooth out some of the grain, even at lower sensitivities such as ISO 200. For anyone looking to get the maximum amount of detail in their files, a 6,000 x 4,000 raw file provides ample resolution and latitude for editing. window.console && console.log && console.log(\"ADS: queuing leader-plus-middle-554d189f71d7f for display\"); var cbsiGptDivIds = cbsiGptDivIds || []; cbsiGptDivIds.push(\"leader-plus-middle-554d189f71d7f\"); Enlarge ImageJPEG processing places a greater emphasis on bringing out details in the shadows. You can also see the lens distortion it corrects for on the left and top. Dave Cheng/CNET Video on the M3 is not its strong point. Tracking and continuous autofocus does a great job of following moving subjects, but through the kit lens it's all somewhat flat, and the only way you can get the most out of the video autofocus is with one of the few STM (stepper motor) lenses. The 3.5mm mic input should help with sound recording but there's no audio output for monitoring sound.Design and features View full gallery (9 Photos)The M3's grip strikes the right balance between size and usability Dave Cheng/CNET Build quality is on par with Canon's magnesium alloy DSLRs, though without the weather sealing. The magnesium alloy/stainless steel body doesn't creak when gripped tightly like cameras made of plastic are prone to. The recessed grip strikes a nice balance between usefulness while maintaining a low profile. The vulcanised rubber gives it the familiar feel of a DSLR and the body itself takes many of its cues from Canon's DSLRs. Shutter speed and aperture have dedicated dials while ISO is an easy press of the combined directional pad/toggle wheel located at the thumb. With no manual focus switch on the lens, MF is selectable via the thumb dial along with flash modes. Those familiar with Canon's menu system of the past few years will find the M3 easy to navigate. Users can also customise their own menu with up to six selections for menu options they find themselves frequenting. The touch screen offers a sharp view of the scene. It's easy to use and responsive but all functionality is also available via the dials. Where the touch screen comes into its own is in selecting a focus point. It's fast and accurate, and while navigating the menu and changing the exposure is often better via the dials, selecting focus is overwhelmingly faster with a tap of the screen. The quick menu button on the top right hand of the touch screen offers fast access to AF mode, image size and quality, movie recording quality, self-timer, white balance, metering and aspect ratio. It saves on menu-diving and streamlines the shooting experience. The articulated screen also comes in handy and offers three alternative shooting styles. The screen can angle 45 degrees downwards for holding the camera up which works well for the street photographers or those looking to shoot from a lower angle. Paired with the self-timer function and the screen rotated 180 degrees and it's ready to take the next selfie. View full gallery (9 Photos)Remote shooting with the 'EOS Remote' app Dave Cheng/CNET ", "title": "Finally, a Canon ILC that's as good its competitors"},
{"url": "http://www.cnet.com/pictures/youre-using-your-refrigerator-wrong-pictures/", "sitename": "Cnet", "datetime": "April 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDTApril 7, 2015 4:21 PM PDT", "body": "", "title": ""},
{"url": "http://www.cnet.com/products/koss-pro-4s-headphones/", "sitename": "Cnet", "datetime": "2015-04-13T16:07:00-0700", "body": " The Pro4S over-ears ($149 in the US; available in the UK and Australia for about £130 and AU$190) are part of a new trio of headphones recently announced by Koss, but while the SP330 and SP530 take aim at the average music-loving consumer, the Pro4S are studio monitor headphones designed to be used in a recording studio by audio engineers, producers, and anyone else at the source concerned with a clean sound without aural additives. Koss is up against tough competition in this marketplace since many of the current best-selling \"professional\" headphone monitors like the Sennheiser HD280 and the Sony MDR-7506 have remained in the winner's circle for more than a decade, but the Pro4S hopes to deliver the audiophile's fantasy of an accurate, noise-attenuating headphone that can be used for both studio monitoring and everyday listening. Headphones built for studio professionals are concerned a lot more with sound design and all-day comfort rather than modern notions of aesthetic appeal like bright colors and flashy materials, which could explain why some of the industry standards have remain aesthetically unchanged (and kind of ugly) since the 1990s. Sarah Tew/CNET The Pro4S, on the other hand, puts a modern spin on some of those classic headphones without sacrificing necessary comforts like a ear cups wrapped in memory foam, a wide, generously padded headband, and a supremely lightweight chassis that weighs just under seven ounces. I tested these headphones for a week and they're exceedingly more comfortable than the bulky Sennheiser HD280s, to the point where they become almost unnoticeable while they're on. Sarah Tew/CNET Instead of the usual circular padding we see on most over-ear headphones, the Pro4S features D-shaped aluminum ear pads that are offset at an obtuse angle relative to the headband so they sit a little further back on your head, which actually feels more secure and resistant to accidental movement while you're listening. Music professionals will be thankful to see that the Pro 4S gives the option to connect the included coiled cable to either the left or right side. Additionally, the empty jack can still output audio so anyone else with their own headphones can also plug into the listening party without bringing around one of those annoying little headphone splitters. Sarah Tew/CNET The ear cups swivel 180 degrees to allow the listener to monitor with an open ear, and both ear piece sections fold up flat against the headband for compact travel in the ballistic nylon carrying case included with the headphones. You'll also find a smaller pouch with a quarter-inch adapter inside so you can plug the headphones into a home receiver or mixing board, but I was disappointed to see that Koss doesn't include another cable with an in-line microphone and music player to navigate tracks and adjust volume on the fly.", "title": "Lightweight studio monitor headphones for engineers, producers and attentive audiophiles"},
{"url": "http://www.cnet.com/products/sony-mdr-z7/", "sitename": "Cnet", "datetime": "2015-05-06T15:40:00-0700", "body": "Sony offers a huge range of headphone models, but it hasn't made a headphone that goes toe to toe with the top audiophile models in quite some time. The MDR-Z7 is such a headphone. It looks, feels and sounds like the real deal -- and it better, considering it costs $700 (£550, AU$1000), though it can be found for less online.At this price point, a lot of audiophiles choose to go with an open-back headphone to get that more open, airy quality that open-back headphones deliver (the Beyerdynamic T90, HiFiMan HE-400i or various Grados, for example). The MDR-Z7 is a closed-back design but manages to sound more like an open-back, so imaging is broad and beautifully focused.The benefit of that closed-back design is that the MDR-Z7 doesn't leak much sound and its plush \"pressure-relieving urethane cushions\" with 3D-sewn covers do a good job passively sealing out ambient noise. This is a really comfortable headphone and while not as light as the MDR-1A, it's relatively light (335 g or 11.8 oz. without cable) for a full-size high-end headphone that has a sturdy metal headband and hinges.Enlarge ImageThe MDR-Z7 is a sturdily built, very comfortable headphone. Sarah Tew/CNET It's also worth noting that the MDR-Z7 has been designed to be a quiet headphone so as not to take away from the listening experience: \"Precise component machining, with the added placement of silicon rings around every moving axis, realizes smooth and silent earcup movement,\" Sony says.You get two detachable oxygen-free copper cables: a 3-meter (9.8-foot) conventional stereo cable and a shorter 2m (6.5-foot) double-headed balanced audio cable that splits the channels and is designed to work with balanced audio headphone amplifiers like Sony's $1,000 PHA-3. You can use the headphones with a mobile device, but that 3m cable is a little long for on-the-go-use.If you want to try to eke out even better sound out of the headphones, Sony also sells braided cable upgrades (courtesy of Kimber Kable) that are designed for home, on the go and balanced amplifier use. A gold-plated 1/8-inch (minijack) to 1/4-inch (phono) plug adapter is included, but no headphone case or protective carrying pouch ships with the headphones.Enlarge ImageThe headphones feature 70mm drivers and plushly padded earcups. Sarah Tew/CNET We tend to jury test a lot of the headphones we review, and I had editor Ty Pendlebury and CNET contributor Steve Guttenberg try these headphones (Steve reviewed them for another publication, so he was already familiar with them). We all agreed they're bona fide audiophile headphones. ", "title": "A high-end Sony headphone that's truly high-end"},
{"url": "http://www.cnet.com/products/kenmore-74343-gas-range-with-convection-oven/", "sitename": "Cnet", "datetime": "2015-05-08T11:35:41-0700", "body": "The 74343 by Kenmore costs $1,400. In range-land, that certainly isn't cheap (you can find models for less than 400 bucks), but it's a very reasonable price for a nice-looking convection gas model with five burners and a decent oven capacity. Tack on the fact that its display panel is incredibly simple to use and that it makes perfectly golden-brown biscuits and juicy burgers with ease and the high-value 74343 becomes very easy to recommend. Kenmore's isn't the best looking model we've ever tested, but it also doesn't have any blaring design flaws that distract from its overall appearance. It's a basic, stainless-steel range with an equally basic touchpad. And while it doesn't offer any standout design features, the 74343 will do a great job of blending in with most kitchens. It's also particularly easy to use. The main point of access -- aside from turning the burner knobs or opening and closing the oven door -- is the display panel. Some of them have been incredibly stubborn, while others are super sensitive. The 74343's display is responsive and intuitive. It has a full number pad and the timer shows the time remaining in seconds and it's large enough to see from a fair distance. This model doesn't come with a broil pan, a griddle or any other surprise accessories. For your $1,400 you get five burners that range from 5,000 BTUs (for simmering sauces) to 18,200 BTUs (for boiling a large pot of water). The center burner is oval-shaped so you could easily use a griddle if you happen to already have one at home. The 74343 has a 5.6-cubic-foot oven and six rack heights. As far as cooking modes go, it doesn't deviate much from the standard broil, bake, convection bake and convection roast, but it does also offer a slow cook option designed for foods that you'd typically cook at a lower heat for a longer period of time, such as roast beef. View full gallery (9 Photos) Tyler Lizenby/CNET Broiling is an underappreciated oven feature. The broil heat element is located at the top of the oven, and manuals usually suggest moving the rack to one of the top positions so that you're getting a steady supply of close-proximity heat. In that way, the broil mode is roughly comparable to grilling and when done right, can churn out perfectly delectable food. View full gallery (9 Photos) Tyler Lizenby/CNET I made three batches of six burgers using the broil mode and added a temperature probe to each burger to track the time it took for them to all reach a medium-rare/medium 145 degrees. We do this both to see how evenly the burgers cook and to compare the time it takes for all of them to cook against other ranges. As far as evenness, you can really see that the burger in the back right is more of a bright pink than the others. Hamburger broiling test (gas models) KitchenAid KGRS306BSS 14.62 GE PGS920SEFSS 15.83 Samsung NX58F5700 16.25 Kenmore 74343 16.57 LG LSRG309ST 18.9 Electrolux EI30GF35JS 19.25 LG LRG3085ST 19.5 Whirlpool WEG730H0DS 24.08 Note: Time to achieve 145 degrees F, in minutes It took this range 16 minutes and 34 seconds to hit 145 degrees, which is an average score. The $1,640 KitchenAid KGRS306BSS was the fastest gas range so far at less than 15 minutes and the $1,749 Whirlpool WEG730H0DS took the longest by far at more than 24 minutes. Even though the overall burger evenness and time to reach 145 degrees were just OK, the burgers were juicy and had great flavor. View full gallery (9 Photos) CNET ", "title": "This simple gas range wins the race"},
{"url": "http://www.cnet.com/products/poppy-pour-over/", "sitename": "Cnet", "datetime": "2015-04-01T15:49:00-0700", "body": " Poppy Tuesday Amazon announced Dash buttons that let Prime customers replenish frequently ordered products with a push of a button, and among the first appliances to ship with the Dash Replenishment Service baked in is a shiny new pour-over coffee maker from New York-based startup Quirky. It's part of a new line of Dash-powered appliances called Poppy that also includes a smart instant formula machine and a smart pet feeder. The Poppy Pour-Over is an attractive coffee maker with bronze accents that has a built-in burr grinder so your coffee is always brewed from fresh beans. As with other Web-connected coffee makers like this one from Mr. Coffee, coffee lovers can start brewing from anywhere with an Internet connection using the Wink app and the accompanying Wink Hub at home. Enlarge ImagePoppy With the Pour-Over, you can fine-tune and save presets for ideal water temperature, grind size and brew times, then share your favorite brewing recipes using the app for iOS and Android. A double-walled glass carafe keeps your coffee hot and the hopper can store 1.25 pounds of coffee beans at a time with 10- or 20-ounce serving sizes available. As you brew away, a sensor inside the Pour-Over maintains inventory of your remaining coffee beans and filters. When you're running low on either, the smart sensors automatically engage and place an order for you using the Amazon Dash Replenishment Service that you set up beforehand. If it works, the whole system will finally relieve you of the responsibility of keeping track of and refilling your coffee-making supplies. Don't worry, Amazon will also notify you every time it orders something, and you can always edit or cancel an order after it's made. The Poppy Pour-Over, Formula and Pet by Quirky Quirky The Poppy lineup from Quirky also includes Dash Replenishment products for non-coffee-drinking members of your family. The Poppy Formula handles remote control of your infant's feeding schedule through the Wink app and orders formula refills when you're running low. The smart Poppy Pet takes care of your pets in a similar fashion, letting you set a daily feeding schedule while monitoring the remainder of your pet food supply. Quirky hasn't announced pricing or availability for the Poppy products yet, but you can sign up to be notified when more information is released.", "title": "This Quirky smart coffee maker refills its own beans from Amazon's Dash Replenishment Service"},
{"url": "http://www.cnet.com/products/sony-mdr-z7/", "sitename": "Cnet", "datetime": "2015-05-06T15:40:00-0700", "body": "Sony offers a huge range of headphone models, but it hasn't made a headphone that goes toe to toe with the top audiophile models in quite some time. The MDR-Z7 is such a headphone. It looks, feels and sounds like the real deal -- and it better, considering it costs $700 (£550, AU$1000), though it can be found for less online.At this price point, a lot of audiophiles choose to go with an open-back headphone to get that more open, airy quality that open-back headphones deliver (the Beyerdynamic T90, HiFiMan HE-400i or various Grados, for example). The MDR-Z7 is a closed-back design but manages to sound more like an open-back, so imaging is broad and beautifully focused.The benefit of that closed-back design is that the MDR-Z7 doesn't leak much sound and its plush \"pressure-relieving urethane cushions\" with 3D-sewn covers do a good job passively sealing out ambient noise. This is a really comfortable headphone and while not as light as the MDR-1A, it's relatively light (335 g or 11.8 oz. without cable) for a full-size high-end headphone that has a sturdy metal headband and hinges.Enlarge ImageThe MDR-Z7 is a sturdily built, very comfortable headphone. Sarah Tew/CNET It's also worth noting that the MDR-Z7 has been designed to be a quiet headphone so as not to take away from the listening experience: \"Precise component machining, with the added placement of silicon rings around every moving axis, realizes smooth and silent earcup movement,\" Sony says.You get two detachable oxygen-free copper cables: a 3-meter (9.8-foot) conventional stereo cable and a shorter 2m (6.5-foot) double-headed balanced audio cable that splits the channels and is designed to work with balanced audio headphone amplifiers like Sony's $1,000 PHA-3. You can use the headphones with a mobile device, but that 3m cable is a little long for on-the-go-use.If you want to try to eke out even better sound out of the headphones, Sony also sells braided cable upgrades (courtesy of Kimber Kable) that are designed for home, on the go and balanced amplifier use. A gold-plated 1/8-inch (minijack) to 1/4-inch (phono) plug adapter is included, but no headphone case or protective carrying pouch ships with the headphones.Enlarge ImageThe headphones feature 70mm drivers and plushly padded earcups. Sarah Tew/CNET We tend to jury test a lot of the headphones we review, and I had editor Ty Pendlebury and CNET contributor Steve Guttenberg try these headphones (Steve reviewed them for another publication, so he was already familiar with them). We all agreed they're bona fide audiophile headphones. ", "title": "A high-end Sony headphone that's truly high-end"},
{"url": "http://www.cnet.com/products/kenmore-74343-gas-range-with-convection-oven/", "sitename": "Cnet", "datetime": "2015-05-08T11:35:41-0700", "body": "The 74343 by Kenmore costs $1,400. In range-land, that certainly isn't cheap (you can find models for less than 400 bucks), but it's a very reasonable price for a nice-looking convection gas model with five burners and a decent oven capacity. Tack on the fact that its display panel is incredibly simple to use and that it makes perfectly golden-brown biscuits and juicy burgers with ease and the high-value 74343 becomes very easy to recommend. Kenmore's isn't the best looking model we've ever tested, but it also doesn't have any blaring design flaws that distract from its overall appearance. It's a basic, stainless-steel range with an equally basic touchpad. And while it doesn't offer any standout design features, the 74343 will do a great job of blending in with most kitchens. It's also particularly easy to use. The main point of access -- aside from turning the burner knobs or opening and closing the oven door -- is the display panel. Some of them have been incredibly stubborn, while others are super sensitive. The 74343's display is responsive and intuitive. It has a full number pad and the timer shows the time remaining in seconds and it's large enough to see from a fair distance. This model doesn't come with a broil pan, a griddle or any other surprise accessories. For your $1,400 you get five burners that range from 5,000 BTUs (for simmering sauces) to 18,200 BTUs (for boiling a large pot of water). The center burner is oval-shaped so you could easily use a griddle if you happen to already have one at home. The 74343 has a 5.6-cubic-foot oven and six rack heights. As far as cooking modes go, it doesn't deviate much from the standard broil, bake, convection bake and convection roast, but it does also offer a slow cook option designed for foods that you'd typically cook at a lower heat for a longer period of time, such as roast beef. View full gallery (9 Photos) Tyler Lizenby/CNET Broiling is an underappreciated oven feature. The broil heat element is located at the top of the oven, and manuals usually suggest moving the rack to one of the top positions so that you're getting a steady supply of close-proximity heat. In that way, the broil mode is roughly comparable to grilling and when done right, can churn out perfectly delectable food. View full gallery (9 Photos) Tyler Lizenby/CNET I made three batches of six burgers using the broil mode and added a temperature probe to each burger to track the time it took for them to all reach a medium-rare/medium 145 degrees. We do this both to see how evenly the burgers cook and to compare the time it takes for all of them to cook against other ranges. As far as evenness, you can really see that the burger in the back right is more of a bright pink than the others. Hamburger broiling test (gas models) KitchenAid KGRS306BSS 14.62 GE PGS920SEFSS 15.83 Samsung NX58F5700 16.25 Kenmore 74343 16.57 LG LSRG309ST 18.9 Electrolux EI30GF35JS 19.25 LG LRG3085ST 19.5 Whirlpool WEG730H0DS 24.08 Note: Time to achieve 145 degrees F, in minutes It took this range 16 minutes and 34 seconds to hit 145 degrees, which is an average score. The $1,640 KitchenAid KGRS306BSS was the fastest gas range so far at less than 15 minutes and the $1,749 Whirlpool WEG730H0DS took the longest by far at more than 24 minutes. Even though the overall burger evenness and time to reach 145 degrees were just OK, the burgers were juicy and had great flavor. View full gallery (9 Photos) CNET ", "title": "This simple gas range wins the race"},
{"url": "http://www.cnet.com/products/ge-phs920sfss-induction-range/", "sitename": "Cnet", "datetime": "2015-05-07T12:57:00-07002015-05-07T12:57:00-0700", "body": "Editor's note (5/7/2015): We have temporarily removed the review previously available here while we investigate inconsistencies in the large burner boil testing methodologies between this oven and the Samsung NE58H9970WS induction range.", "title": "GE PHS920SFSS"},
{"url": "http://www.cnet.com/products/canon-eos-m3/", "sitename": "Cnet", "datetime": "2015-05-04T13:15:00-0700", "body": " Canon's M3, the company's most recent foray into the growing mirrorless ILC market, is its most promising. Canon's first entry, 2012's EOS M, had widely-reported autofocus issues that turned off many customers before a firmware update addressed the problem. Its successor, the EOS M2, was only released in Japan and China. The third in the series looks to overcome the stumbling blocks of its predecessors, but the real question is whether the M3's respectable specs and DSLR-quality snapshots can make up for its lacklustre lineup of dedicated lenses, and a lesser feature set than closely priced competitors. The M3 is available in the European and Australian markets (while the US remains noticeably absent). Price-wise, the UK and Europe are looking to pay £600 or €770, while Australians can find it for around AU$900 for the kit with the 18-55mm IS STM lens.Image quality Image quality is as good as any of Canon's high-end APS-C DSLRs. Even with a 24.2-megapixel sensor, the camera does a very good job of controlling noise. Colours show good saturation and sharpness at such high resolutions. Most would rarely need all that extra resolution but it does allow a lot of latitude for cropping if the composition was a little off. More than likely though you'll find it comes in handy for cropping subjects because your zoom lens just doesn't reach far enough.Samples Canon EOS M3 sample photos See full gallery 1 - 2 / 8 Next Prev The M-mount 18-55mm IS STM lens that comes with the kit is a solid offering. Like most consumer kit lenses, it doesn't offer a very wide constant aperture at f3.5-5.6. Lens distortion isn't bad by any measure and it handles aberrations well. Canon knows what it's doing with lens design and the 18-55mm IS lens performs well when coupled with the M3's sensor. Luckily performance is mostly up to par, since the camera relies on the 18-55mm as it's one of only four lenses available for the M-series mount. Enlarge ImageAt lower ISOs JPEGs hold up well Dave Cheng/CNET Enlarge ImageAt ISO 3200 onwards details degrade but images are very usable. Dave Cheng/CNET Enlarge ImageThe original framing for the test shots Dave Cheng/CNET Enlarge ImageWithout the EOS-EF M adapter and an EF mount Sigma 50mm f/1.4 Art lens this shot would not have been possible. Dave Cheng/CNET Coupled with the optional Mount Adapter EF-EOS M (roughly £99, AU$130) and Sigma's 50mm f/1.4 Art, the M3 was able to show off its low-light capabilities. Shooting at ISO 6400 produces usable night photos like the cat lit by a street light. It really highlights the strength of Canon's sensor when paired with a quality lens. JPEG processing emphasises bringing out additional detail in the shadows. Raw files display more contrast whereas the JPEGs aim for a more balanced exposure. There's also some mild noise reduction in the JPEGs that smooth out some of the grain, even at lower sensitivities such as ISO 200. For anyone looking to get the maximum amount of detail in their files, a 6,000 x 4,000 raw file provides ample resolution and latitude for editing. window.console && console.log && console.log(\"ADS: queuing leader-plus-middle-554d174559846 for display\"); var cbsiGptDivIds = cbsiGptDivIds || []; cbsiGptDivIds.push(\"leader-plus-middle-554d174559846\"); Enlarge ImageJPEG processing places a greater emphasis on bringing out details in the shadows. You can also see the lens distortion it corrects for on the left and top. Dave Cheng/CNET Video on the M3 is not its strong point. Tracking and continuous autofocus does a great job of following moving subjects, but through the kit lens it's all somewhat flat, and the only way you can get the most out of the video autofocus is with one of the few STM (stepper motor) lenses. The 3.5mm mic input should help with sound recording but there's no audio output for monitoring sound.Design and features View full gallery (9 Photos)The M3's grip strikes the right balance between size and usability Dave Cheng/CNET Build quality is on par with Canon's magnesium alloy DSLRs, though without the weather sealing. The magnesium alloy/stainless steel body doesn't creak when gripped tightly like cameras made of plastic are prone to. The recessed grip strikes a nice balance between usefulness while maintaining a low profile. The vulcanised rubber gives it the familiar feel of a DSLR and the body itself takes many of its cues from Canon's DSLRs. Shutter speed and aperture have dedicated dials while ISO is an easy press of the combined directional pad/toggle wheel located at the thumb. With no manual focus switch on the lens, MF is selectable via the thumb dial along with flash modes. Those familiar with Canon's menu system of the past few years will find the M3 easy to navigate. Users can also customise their own menu with up to six selections for menu options they find themselves frequenting. The touch screen offers a sharp view of the scene. It's easy to use and responsive but all functionality is also available via the dials. Where the touch screen comes into its own is in selecting a focus point. It's fast and accurate, and while navigating the menu and changing the exposure is often better via the dials, selecting focus is overwhelmingly faster with a tap of the screen. The quick menu button on the top right hand of the touch screen offers fast access to AF mode, image size and quality, movie recording quality, self-timer, white balance, metering and aspect ratio. It saves on menu-diving and streamlines the shooting experience. The articulated screen also comes in handy and offers three alternative shooting styles. The screen can angle 45 degrees downwards for holding the camera up which works well for the street photographers or those looking to shoot from a lower angle. Paired with the self-timer function and the screen rotated 180 degrees and it's ready to take the next selfie. View full gallery (9 Photos)Remote shooting with the 'EOS Remote' app Dave Cheng/CNET ", "title": "Finally, a Canon ILC that's as good its competitors"},
{"url": "http://www.cnet.com/products/orange-chef-countertop/", "sitename": "Cnet", "datetime": "2015-04-14T14:42:00-0700", "body": " Orange Chef App-enabled food scales have been smart kitchen fixtures for a while now. Existing products like Drop and Perfect Bake tell you exactly when and how much of a certain ingredient to add so you can feel at ease regardless of your degree of cooking competency. While Orange Chef's new Countertop scale has a lot in common with the competition, it also diverges in one key way. In addition to the standard step-by-step recipe tutorials, Orange Chef has also secured partnerships with Vitamix, Crock-Pot and Jawbone -- and says that there are more to come. The goal here is to make the battery-powered Countertop your one-stop fitness, sleep and nutrition shop. Orange Chef Here's how it's supposed to work: If you've just finished a workout, your Jawbone Up should send all of your workout data to the Countertop iOS app (an Android app is in development). From there, it should suggest optimal post-exercise recipes and walk you through the process. If you happen to have a Vitamix or a Crock-Pot appliance as well, you can buy Orange Chef's optional NFC accessories. With the NFC tech attached, the scale is supposed to instantly recognize what device you're using and offer up Vitamix or Crock-Pot-exclusive recipe suggestions. This doesn't seem all that useful, though, since Vitamix or Crock-Pot owners presumably already have a bunch of device-specific recipe ideas that came with their original purchase. And, it seems unwieldy to have to stick an NFC-tagged Crock-Pot on top of a kitchen scale just to access custom cooking instructions. Still, you can always skip this part and simply use it as a standard Drop or Perfect Bake-style smart scale. Orange Chef's $100 Countertop scale, $10 Vitamix NFC accessory and $5 Crock-Pot NFC accessory are all currently available for preorder now; prices are expected to double when this period ends. After that, the team plans to phase out its $150 Prep Pad -- that's a similar Orange Chef product that's already sold in places like Williams-Sonoma but lacks Countertop's NFC integration. Countertop shipping is slated for mid-December and we've already requested a unit to review.", "title": "Orange Chef cooks up a new Countertop kitchen scale"},
{"url": "http://www.cnet.com/products/skullcandy-grind/", "sitename": "Cnet", "datetime": "2015-04-13T14:55:00-0700", "body": "Truth be told, we haven't been too impressed with Skullcandy's headphone offerings in recent years. But we've finally found one that we like a lot in the Grind, an on-ear model that retails for $60 (£40 in the UK; no official Australia pricing yet, but the US price translates to around AU$79) and comes in several different color options -- some better than others -- including some eye-catching translucent versions.The Grind is lightweight but seems sturdily constructed, with a metal headband, and it's comfortable to wear, particularly for an on-ear model. I can't tell you how it's going to hold up over time because I've only used it for about a week, but on the plus side it's got a detachable cable, an L-shaped plug, and the plastic earcups don't look or feel cheap (Skullcandy reps told me they're using high-quality polycarbonate). On the downside, I kept the headphones in my backpack when not in use, and the earcups on the darker translucent model did show some scratches after a few days.Enlarge ImageThe Grind features a remote/microphone integrated into the left earcup. Sarah Tew/CNET The Grind also sounds surprisingly good for the price and comes with an interesting feature: Instead of having the remote and microphone built into the detachable cord, they're integrated into the left earcup, which is similar to the the setup you'd get with a wireless Bluetooth headphone.A button on the outside of the ear cup -- Skullcandy calls the feature \"TapTech\" -- lets you take calls, play or pause tracks and skip them forward and back. It's designed for use with both iPhones and Android phones, but doesn't have any volume controls. (Headphone companies have to pay a licensing fee to Apple for MFi -- \"Made for iPhone\" -- certification in order for their inline remotes' volume controls to work with iOS devices, so some companies are choosing to leave those controls off.)Enlarge ImageThe headphone comes in several color options and features a metal headband. Sarah Tew/CNET For $60, you're not going to do much better for sound. There's a touch of bass and treble push with a little dip in the midrange, but overall the Grind is a well-balanced headphone that offers decent clarity and is pleasant to listen to. You're also not going to get the richness and refinement you would from a higher-end headphone, and the on-ear design doesn't seal out ambient noise as well as an over-ear model would.", "title": "A well-designed on-ear headphone that sounds surprisingly good for its modest price"},
{"url": "http://www.cnet.com/products/denon-heos-1/", "sitename": "Cnet", "datetime": "2015-05-06T14:17:00-0700", "body": " Denon As a fan of multi-room music I'm often surprised by the relative lack of portable Wi-Fi speakers offered by the big players. Sonos doesn't have one, nor Samsung, and there's nothing sporting Play-Fi yet, but to redress the balance Denon has just announced a $199 model for its plucky HEOS system.The HEOS 1 is a humidity-resistant, two-way speaker which connects to Denon's multi-room system and offers playback from network devices plus streaming services such as Spotify, Pandora, and SiriusXM. The system operates over WI-Fi and is operated with the free HEOS app, but it is sadly not compatible with hi-res files.The Denon HEOS 1 Go pack clips onto the speaker. Denon With the addition of the $99 HEOS 1 Go pack the 1 becomes a splash-proof speaker with a 6-hour battery and a USB-to-Bluetooth adapter.The HEOS 1 has a 3.5mm input which can also be distributed around the house, and uniquely so can the Bluetooth receiver when connected to Wi-Fi.Like the competitive Sonos Play:1 the HEOS 1 can also form part of a stereo pair for better stereo imaging.Despite being sued by Sonos in October 2014 for potential copyright infringement Denon has remained defiant. For example, its press release for the HEOS 1 says: \"In the future, the Denon HEOS series will continue to expand with new and innovative products.\"", "title": "Denon unveils $199 portable HEOS 1 speaker"},
{"url": "http://www.cnet.com/products/feit-electric-homebrite-bluetooth-smart-led-system/", "sitename": "Cnet", "datetime": "2015-05-06T07:45:00-0700", "body": " Ry Crist/CNET California-based manufacturer Feit Electric is getting into the smart lighting game, with new low-cost connected LEDs that sync with your smartphone -- and each other -- over a Bluetooth mesh network. Branded \"HomeBrite,\" the LEDs are slated to arrive in stores and online this August and were on display this week at the Lightfair International trade show in New York City. Ry Crist/CNET The HomeBrite line will launch with five bulbs to its name, including standard, A-shaped bulbs, BR300 and PAR38-shape floodlights, and a recessed fixture retrofit kit. You'll also find a B10-shape candelabra bulb -- the first smart light from a major manufacturer to carry such a form factor. Each bulb uses a Bluetooth Smart radio to communicate with you and with the rest of the bulbs in your setup, with each one constantly pinging the rest to keep track of the time. If you tell the bulbs to turn on at 6:00 a.m., they'll know right when to go. You can also set timers that'll turn the bulbs on or off after a countdown, or slowly fade the lights up or down for its duration. You'll set those timers using Feit's control app for Android and iOS devices. Though it isn't finalized, Feit's team let me play with it a bit on the Lightfair show floor -- it's a clean, uncluttered design that looks good and works well, as far as I could tell. Hopefully, it doesn't change too much between now and August. Enlarge Image Ry Crist/CNET With Bluetooth as the means of communication, there's no control hub, wires, or extra hardware necessary -- not even a router or a local Wi-Fi network. Each bulb will work straight out of the box: just screw it in, turn it on, and pair it with your phone through the app. That's an attractive approach for consumers who want something simple, though Bluetooth's relatively short range limits you to local controls. If you're at the office and realize you forgot to turn a light off at home, you won't be able to turn it off from the app. Also attractive: the price point. Though Feit's press materials make no mention of what the bulbs will cost, multiple company representatives tell me that the A-shaped bulb will sell for $15 -- the same price as the Cree Connected LED and the GE Link LED, both of which require additional hub hardware to function. Pricing for the other HomeBrite bulbs isn't set yet, though the retrofit recessed fixture will likely be the most expensive -- Feit tells me it'll ring up somewhere around $35. Ry Crist/CNET Moving forward, Feit's team won't rule out the possibility of integrating with a third-party control gateway to help extend the system's range. Despite Feit's skepticism about hub-centric smart homes, a partnership with something like the August Smart Lock, which already sells a Bluetooth-to-Wi-Fi gateway, might make an awful lot of sense. At any rate, we'll know more by this summer, once we get a chance to put the new bulbs through their paces. Expect a full review at that time.", "title": "Feit gets into the smart light fight with Bluetooth LEDs"},
{"url": "http://www.cnet.com/products/whirlpool-5-8-cu-ft-front-control-gas-stove-with-fan-convection/", "sitename": "Cnet", "datetime": "2015-04-01T15:00:00-0700", "body": " On paper the $1,749 Whirlpool Front Control Gas Stove (model number WEG730H0DS) looks like a strong contender for your kitchen upgrade cash. It boasts five gas burners, and a large, 5.8-cubic-foot convection oven. Add in Whirlpool's attractive stainless-steel styling, clever front-mounted controls, plus solid build quality and buying this gas range seems like a superb idea. Sadly the Whirlpool Front Control Gas Stove has a few significant flaws that are hard to ignore, the biggest of which is its slow cooking times. The oven's lack of a center oval burner and a mere two bundled oven racks are also a big letdown, especially for an appliance this expensive. Unless you're absolutely head-over-heels in love with the Front Control's distinctive design, this feature-packed Samsung Gas Range with a convection oven (NX58F5700) is a better deal. Immediately after removing the Whirlpool Front Control Gas Stove from its crate I was struck by its distinctive appearance. What sets the stove apart, and as its name suggests, are four prominent burner knobs mounted on the front of the unit. Instead of the typical forward-facing placement, though, these dials sit on top of a flat command center that occupies the first 5 inches of the range's 28.3-inch depth. Enlarge ImageThe Whirlpool WEG730H0DS has a distinctive front control panel and front-mounted burner knobs. Tyler Lizenby/CNET I also like how this surface is angled downward ever so slightly. This simple detail helps the dials remain within easy reach without causing undue wrist strain. They flank a wide, recessed control panel, and within the panel are touch membrane-covered keys for commanding the oven's many functions. It also has a small LED screen and a dial to control the range's center burner. The Whirlpool Front Control's cooktop comes with with five gas burners. The right side houses one 9,200-BTU burner in the rear and a large 15,000-BTU burner in the front. On the left and in front you'll find the stove's most powerful element, a large 17,000-BTU burner, and behind that is the range's smallest burner, rated at 5,000 BTU, to tackle low-heat cooking such as warming soups, simmering sauces and melting chocolate. The fifth burner is a small circular one that is rated to output 8,000 BTU of heat. All these burners are tucked underneath a pair of flat cast-iron grates that are covered in porcelain-coated steel. Heavy and extremely solid, the black grates form a very handsome cooking surface. Besides simply looking expensive and feeling durable, the level cooktop makes it easy to slide pots and pans around without worrying about them snagging on or bumping into ridges and other obstacles. Enlarge ImageYou get five gas burners to play with ranging from 5,000 BTU to 17,000 BTU. Tyler Lizenby/CNET There are some drawbacks to the Whirlpool Front Control Stove's cooktop. For instance, while its high-power burner offers a respectable 17,000 BTU, other competing ranges such as the Samsung NX58F5700 provide 18,000 BTU. Another letdown is the lack of a special oval-shaped center burner, which is ideal for accommodating long griddle pans. This is a feature that's also in the NX58F5700, as well the Electrolux 30-inch Gas Freestanding Range. The main oven door sports a substantial curved polished-steel handle. Opening it reveals a spacious 5.8-cubic-foot oven cavity that Whirlpool equips with seven rack guides for manually positioning either of the two bundled oven racks -- one standard flat rack and one recessed half-rack. Unfortunately Whirlpool doesn't include a third gliding rack as does Samsung with both the NX58F5700 and Induction Chef Collection ovens. Enlarge ImageThis oven comes with a large 5.8-cubic-foot cavity complete with convection fan. Tyler Lizenby/CNET At the back of the wall of the oven cavity sits a big fan that enables the Whirlpool Front Control's convection roasting and baking functions. The company says the oven's convection-style cooking uses air flow to achieve more even browning and faster cooking times compared with conventional ovens. Standing 36 inches tall and measuring 30 inches wide by 28.3 inches deep, however, this range is certainly compact. And with no back control panel the appliance qualifies as a true slide-in unit. It's a plus for kitchen renovators who desire a more expensive built-in look, not the basic appearance associated with free-standing stoves. For all its stylish looks and attractive stainless-steel design, the Whirlpool Front Control Gas Stove certainly underwhelmed us in the performance department. Despite the claimed 17,000 BTU might of its main large burner, the range turned in some of the slowest cooking times we've measured. View full gallery (13 Photos)The Whirlpool WEG730H0DS' large burner heated water relatively slowly. Megan Wollerton/CNET ", "title": "Whirlpool's lovely range has power on paper, not in practice"},
{"url": "http://www.cnet.com/products/denon-heos-1/", "sitename": "Cnet", "datetime": "2015-05-06T14:17:00-0700", "body": " Denon As a fan of multi-room music I'm often surprised by the relative lack of portable Wi-Fi speakers offered by the big players. Sonos doesn't have one, nor Samsung, and there's nothing sporting Play-Fi yet, but to redress the balance Denon has just announced a $199 model for its plucky HEOS system.The HEOS 1 is a humidity-resistant, two-way speaker which connects to Denon's multi-room system and offers playback from network devices plus streaming services such as Spotify, Pandora, and SiriusXM. The system operates over WI-Fi and is operated with the free HEOS app, but it is sadly not compatible with hi-res files.The Denon HEOS 1 Go pack clips onto the speaker. Denon With the addition of the $99 HEOS 1 Go pack the 1 becomes a splash-proof speaker with a 6-hour battery and a USB-to-Bluetooth adapter.The HEOS 1 has a 3.5mm input which can also be distributed around the house, and uniquely so can the Bluetooth receiver when connected to Wi-Fi.Like the competitive Sonos Play:1 the HEOS 1 can also form part of a stereo pair for better stereo imaging.Despite being sued by Sonos in October 2014 for potential copyright infringement Denon has remained defiant. For example, its press release for the HEOS 1 says: \"In the future, the Denon HEOS series will continue to expand with new and innovative products.\"", "title": "Denon unveils $199 portable HEOS 1 speaker"},
{"url": "http://www.cnet.com/products/feit-electric-homebrite-bluetooth-smart-led-system/", "sitename": "Cnet", "datetime": "2015-05-06T07:45:00-0700", "body": " Ry Crist/CNET California-based manufacturer Feit Electric is getting into the smart lighting game, with new low-cost connected LEDs that sync with your smartphone -- and each other -- over a Bluetooth mesh network. Branded \"HomeBrite,\" the LEDs are slated to arrive in stores and online this August and were on display this week at the Lightfair International trade show in New York City. Ry Crist/CNET The HomeBrite line will launch with five bulbs to its name, including standard, A-shaped bulbs, BR300 and PAR38-shape floodlights, and a recessed fixture retrofit kit. You'll also find a B10-shape candelabra bulb -- the first smart light from a major manufacturer to carry such a form factor. Each bulb uses a Bluetooth Smart radio to communicate with you and with the rest of the bulbs in your setup, with each one constantly pinging the rest to keep track of the time. If you tell the bulbs to turn on at 6:00 a.m., they'll know right when to go. You can also set timers that'll turn the bulbs on or off after a countdown, or slowly fade the lights up or down for its duration. You'll set those timers using Feit's control app for Android and iOS devices. Though it isn't finalized, Feit's team let me play with it a bit on the Lightfair show floor -- it's a clean, uncluttered design that looks good and works well, as far as I could tell. Hopefully, it doesn't change too much between now and August. Enlarge Image Ry Crist/CNET With Bluetooth as the means of communication, there's no control hub, wires, or extra hardware necessary -- not even a router or a local Wi-Fi network. Each bulb will work straight out of the box: just screw it in, turn it on, and pair it with your phone through the app. That's an attractive approach for consumers who want something simple, though Bluetooth's relatively short range limits you to local controls. If you're at the office and realize you forgot to turn a light off at home, you won't be able to turn it off from the app. Also attractive: the price point. Though Feit's press materials make no mention of what the bulbs will cost, multiple company representatives tell me that the A-shaped bulb will sell for $15 -- the same price as the Cree Connected LED and the GE Link LED, both of which require additional hub hardware to function. Pricing for the other HomeBrite bulbs isn't set yet, though the retrofit recessed fixture will likely be the most expensive -- Feit tells me it'll ring up somewhere around $35. Ry Crist/CNET Moving forward, Feit's team won't rule out the possibility of integrating with a third-party control gateway to help extend the system's range. Despite Feit's skepticism about hub-centric smart homes, a partnership with something like the August Smart Lock, which already sells a Bluetooth-to-Wi-Fi gateway, might make an awful lot of sense. At any rate, we'll know more by this summer, once we get a chance to put the new bulbs through their paces. Expect a full review at that time.", "title": "Feit gets into the smart light fight with Bluetooth LEDs"},
{"url": "http://www.cnet.com/products/lg-ldc24370st-bottom-freezer-refrigerator/", "sitename": "Cnet", "datetime": "2015-04-27T14:07:00-0700", "body": " How much does refrigerator performance matter to you? If your answer is anything north of \"some,\" you'll want to pay attention, because the $1,800 LG LDC24370ST bottom-freezer fridge offers the best performance of any refrigerator we've tested to date. That includes high-end models like the Samsung Chef Collection fridge and LG's own LMXS30776S, which retails for about $4,000.It's not the most eye-catching design, and the stainless steel finish is about as smudgeable as refrigerators get, but it comes packed with thoughtful, user-friendly features and plenty of storage space -- enough so to justify the price point. If you're looking for a refrigerator but don't want to spend more than two grand, this is one of the best options we've found. At $1,800, the LG LDC24370ST is about as expensive as bottom freezer refrigerators come, but it works to justify the cost with a 24-cubic-foot capacity (bigger than any other top brand bottom freezer I could find) and more features than you might expect from such a simple-looking fridge. That's not to say that it's an inherently huge fridge, or one that's particularly feature-rich -- French door models in the same price range will often boast bigger builds and flashier features. If fridge capacity and the sheer number of bells and whistles you get are your main motivations to buy, then one of those is almost certainly a better fit for your kitchen. Enlarge Image Tyler Lizenby/CNET Bottom freezers aren't known for their fancy designs -- they're really just top freezers flipped upside down, with the fridge compartment up at a more comfortable height. Of course, that puts the frozen stuff down at your shins, but thankfully, this LG model utilizes a drawer-style freezer instead of one with a hinged door. That was a good call -- bottom freezers with hinged freezer doors are a real pain to get things in and out of, though they typically cost a little less. Sure enough, LG offers a very similar bottom freezer without a drawer for about $1,500. You can also save $100 by passing on the stainless steel finish and going for the same fridge in white. That might be more of a temptation with this fridge than with others, as the stainless steel finish is about as fingerprint-prone as I've seen. Other stainless steel models like the Frigidaire FGHB2866PF offer smudge-proof finishes that are a lot easier to keep clean. Inside of the fridge, you'll find three main shelves atop two crisper bins with adjustable humidity vents. There's also a third \"Glide N' Serve\" drawer that runs the width of the fridge. It pulls out smoothly, with the hinged plastic cover automatically lifting up and out of the way, and offers plenty of room for meats and cheeses, along with wide items like party platters. In the default position, none of the three main shelves had enough vertical clearance to accommodate a jug of milk or a carton of orange juice, which seemed odd to me. Thankfully, the shelves are removed and replaced easily enough, and after repositioning the middle shelf one step higher, I had all the space I needed. Enlarge Image Tyler Lizenby/CNET You'll find the refrigerator's temperature controls in the form of a digital touch display on the inside of the door frame. I was happy to see independent controls for the fridge and freezer compartments -- with some lower-end models, like the GE GTE18GMHES top freezer, the two compartments share a thermostat, which means you can't adjust one without adjusting the other. Not a problem with this LG model. The door comes packed with plenty of shelf space, including shelves that are easily wide enough to fit bulky items like beer and soda. If you're trying to fit an especially tall item like a bottle of wine, the top right shelf folds up and out of the way to give you extra room. You'll also find plastic dividers in each of the main in-door shelves that slide back and forth to help you section things off -- not the most useful feature I've ever seen in a fridge, but a nice organizational touch, nonetheless. Everything about the fridge felt sturdy and well-constructed. From the smooth-sliding Glide N' Serve drawer to the sufficiently spill-proof shelving, it's an interior that has the premium feel of something more expensive than it actually is. The stainless steel bottom freezer build is nothing terribly fancy, but if you're willing to pass on flashy French door looks, there's a lot to be happy with here. Enlarge Image Tyler Lizenby/CNET The LDC24370ST is as strong a performer as we've seen from any fridge we've tested thus far, but to understand that claim, you need an idea of what we're looking for in our fridge performance tests. First off, you want your fridge to be accurate. If it lets you select a specific temperature, then you want as many regions of the fridge to fall as close to that target temperature as possible. You also want those regions to be consistent with each other -- if one shelf is noticeably warmer than a neighboring one, then your milk might expire faster in one spot than in another. That's not good. By that first metric, the LDC24370ST came through, but not with total accuracy. With the fridge set to 37 degrees F, the temperatures all averaged out a degree or two warmer over the course of a three-day test. That's close enough to be satisfying (everything in the body of the fridge stayed below 40 degrees, an FDA benchmark for food safety), but still, it isn't perfect.", "title": "Near-perfect performance from this LG fridge"},
{"url": "http://www.cnet.com/products/pentax-k-s2/", "sitename": "Cnet", "datetime": "2015-05-01T11:56:00-0700", "body": " Ricoh has been plugging away in the consumer dSLR space, even using flashing lights and a cornucopia of colors to attract first-time and family buyers to its Pentax models, away from more staid Nikons and Canons. With the K-S2, the company combines Pentax's two-tone tendencies and colored lights with a more staid design sensibility and the weather-sealed body, large viewfinder and solid photo quality that have long been the hallmarks of Pentax's entry-level cameras. The result is a really nice option, with a single big weakness: video capture.Image quality Overall, the photos look excellent. JPEGs are clean up to ISO 800 -- ISO 1600 in good light. Beyond that, they get soft fast. Color is very good; bright and saturated yet still accurate in its default Bright setting. Auto white balance is generally good, though in indoor lighting, photos develop a yellowish/pinkish cast, depending upon the light sources. Pentax K-S2 photo samples See full gallery 1 - 5 / 7 Next Prev At press time, the only raw support for the K-S2 was the bundled SilkyPix software, and as far as I can tell there isn't a lot of detail you can recover from blown-out highlights without simply turning them brown, though you can bring up shadows without introducing too much noise. (Unfortunately, despite its popularity as a bundle choice, SilkyPix is -- at best -- impenetrable. Nor can you save as DNG for use in another program. I saved as a 16-bit TIFF file and used that in Lightroom .) The big disappointment here is the video quality. If you leave shake reduction on, which most people probably want to do, the movies have a bad case of the wobbles; not just typical horizontal jello (rolling shutter), but vertical as well. If you turn off the SR, the wobbles go away but then it's got the shakes. Those issues aside, video also suffers from serious moire -- brick buildings in the background are covered in not-so-groovy rainbows. The camera has Pentax's AA-filter simulator, which defeats the moire that results from removing the anti-aliasing filter from the sensor (which blurs the image just a bit in exchange for removing visual errors from high-frequency patterns). The simulator shifts the sensor slightly for a second shot and combines the two to cancel out the patterns. Unfortunately, the AA-filter simulator is not available during movie capture. It's also limited for general movie recording because it lacks continuous autofocus in movie mode. You have to focus manually or prefocus and hope your subject doesn't move from the focal plane. Given how noisy the inexpensive Pentax lenses are, I can understand the company forgoing continuous AF. It does have good focus peaking (outlines for in-focus edges), which makes manually focusing relatively easy.Analysis samples Enlarge ImageIn-focus details for JPEG images remain pretty sharp up through ISO 1600. Lori Grunin/CNET Enlarge ImageOnce you pass ISO 1600, though, out-of-focus areas start mushing up quickly; in-focus spots are usable up through ISO 6400. Lori Grunin/CNET window.console && console.log && console.log(\"ADS: queuing leader-plus-middle-554d15a131f80 for display\"); var cbsiGptDivIds = cbsiGptDivIds || []; cbsiGptDivIds.push(\"leader-plus-middle-554d15a131f80\"); Enlarge ImageThe K-S2's white-balance and default color settings are generally pretty good. Lori Grunin/CNET Enlarge ImageThe 18-50mm lens renders nicely round out-of-focus highlights, but concentric patterns in the circles are an artifact of the optical design needed to produce a collapsible lens. Lori Grunin/CNET Performance Editors' Note: We haven't tested any comparable cameras since reworking our test methods last summer, so we're not including a comparison chart. It will be included when we test other comparable cameras in the future. I'd rank the K-S2's performance as good -- certainly good enough for the basic \"kids, pets and travel\" photography for which it's intended -- but not better than average. It's a little slow to start up at 1.2 seconds, which is a mirrorless-camera level performance rather than dSLR. it takes about 0.4 second to focus and shoot in good light, which slows to about 0.5 second in dim. Unfortunately, it doesn't always refocus when you press the shutter, and in general the kit lens is a slow mover, so the time it takes to focus depends upon how far out of focus you're starting from. It fares better when it comes to two shots in a row: 0.2 second regardless of whether it's raw or JPEG, which is good. And it only jumps to 0.9 second with flash enabled. Though it's rated at 5.5 frames per second for continuous shooting, I couldn't get it to work that fast with autofocus enabled. With AF -- our normal test conditions -- it maxed out at 4.6fps for about 40 JPEGs and 4.5fps for about 10 raw. With focus fixed on the first frame and a shutter speed of 1/250 second I got it up to 5.4fps. However, 4.6fps should be fine for most burst-shooting situations. The autofocus performance, however, was a bit frustrating. Aside from the aforementioned occasional reluctance to even try to focus, I found that in situations where focus was critical -- most notably during our lab testing -- it was off just a hair. I ended up having to manually focus for best results. It could be the new collapsible kit lens, which, with the exception of the ability to focus fairly close, is pretty disappointing. Or it could be vibration from the thwack of the loud shutter and mirror slap. But in most cases the focus is generally fine and continuous shooting with the 18-135mm lens had a decent hit rate where the panning focus accuracy (manually following bicyclists as they ride through the frame) was good enough for most uses. It does offer expanded-area autofocus, which uses surrounding points as backup when the subject moves off of your selected focus point. The battery life isn't great, either, but that seems to be a trend thanks to the effort to make the bodies smaller. ", "title": "The K-S2 is a solid first-dSLR option if you don't care about video"},
{"url": "http://www.cnet.com/products/lg-lrg3085st-5-4-cu-ft-capacity-freestanding-gas-oven/", "sitename": "Cnet", "datetime": "2015-04-14T12:35:00-0700", "body": "The $1,649 LG LRG3085ST Free-Standing Gas Oven is built to make a good first impression. Its stainless steel chassis is easy on the eyes while its more tangible attributes, front-mounted controls, easy to operate touch panel, oval center burner, and convection oven are worthy features to have on hand in the kitchen.Unfortunately this range's sluggish cooking times and lack of any distinctive extras make similarly priced options such as the $1,699 Samsung NX58F5700 and $1,649 KitchenAid KGRS306BSS better appliance deals. Both products are also superior performers, especially Samsung's oven which looks just as pretty yet offers greater space for baking and roasting and is jam-packed with extras.As free-standing ovens go the LG LRG3085ST is actually quite attractive. Sure it relies on the tried-and-true blocky stove shape complete with a back-mounted touch panel, which range manufacturers have used for decades. That said LG also decided to throw in a few snazzy design elements such as shiny stainless steel surfaces contrasted by sober black elements.Enlarge ImageThe LG LRG3085ST flaunts stainless steel looks anchored by deep black accents. Tyler Lizenby/CNET Specifically a steel skin covers much of the appliance's front face including the oven door and warming drawer below it, both of which sport sturdy curved metal handles. Likewise the flat touch panel in the rear, beyond the cooktop, is framed by a wide silvery border crafted in iridescent brushed metal. You'll find a gas cooktop on the LG LRG3085ST's range whose five-burners live beneath a flat cast-iron grate. Both the grate, burners, and range surface are cast in a shade of deep black. The burners themselves range in power from a max of 1,700 BTU down to 5,000 at the low end. One welcome feature is a center oval burner (8,000 BTU) which comes with its own removable griddle pan accessory. Enlarge ImageThe cooktop has five gas burners including an oval one in the center. Tyler Lizenby/CNET Underneath the cooktop sit five front-facing burner control knobs which while silver in color are actually constructed from plastic. They still feel solid, and turn with satisfying precision, but the metal knobs on the competing Samsung oven make the plastic which LG has used here feel like a shortcut.Enlarge ImageThe knobs may be plastic but they feel premium enough. Tyler Lizenby/CNET The LG LRG3085ST range has a 5.4 cubic foot capacity oven cavity to handle your baking needs. Admittedly that's smaller than many of its competitors such as the KitchenAid KGRS306BSS and Samsung NX58F5700, both of which provide 5.8 cubic feet of oven room to play with.Enlarge ImageThe oven cavity offers a slightly smaller 5.4-cubic foot capacity. Tyler Lizenby/CNET And if you're expecting much in the way of slick accessories this isn't the oven for you. Outside of the griddle pan and oval center burner, the LRG3085ST only comes with basic flat oven racks (though there are three of them) for use with its seven slots.What this oven does have at its disposal is a big internal fan linked to its own heating element for European convection (often called true convection) baking and roasting. Euro convection typically offers either faster cooking times or satisfactory results at lower temperatures. I can't deny that using the LG LRG3085ST is a simple, fun and, at times, an even entertaining process. The oven's back-mounted touch panel is clearly laid out using a minimum of buttons. I also like that instead of the often inscrutable symbols you'll find grafted onto the buttons of many other oven controls, the LRG3085ST's keys are labeled with straightforward English text.", "title": "This stylish steel range from LG boasts convection but cooks on the slow side"},
{"url": "http://www.cnet.com/products/sol-republic-shadow-wireless/", "sitename": "Cnet", "datetime": "2015-03-24T10:40:00-0700", "body": "LG made the around-the-neck design popular with its line of Tone Bluetooth headphones; now Sol Republic says it's improved the design with its Shadow Wireless, which it calls the first in-ear wireless headphone to feature a NASA-inspired \"biomorphic\" design.At launch, the headphone comes two colors -- the black you see pictured and a \"rich\" gray -- and costs $100 or pretty much exactly what a wireless headphone of this caliber should cost.Enlarge ImageThe Sol Republic Shadow Wireless will cost $99.99 when it hits stores in June. Sarah Tew/CNET The Shadow Wireless is water-resistant and you can use it at the gym, but it's not a being marketed as a sports headphone and I wouldn't try to run with it because the earpieces will probably slip out. While I can't tell you exactly how durable this headphone is and how it'll hold up over time, it does seem sturdier than the majority of LG's Tone headphones and I found it comfortable to wear.The earbuds fit well (you get a few different size ear tips) and the bendable nature of the collar conforms nicely to the contour of your neck, which is I guess what Sol Republic means by biomorphic design. With this type of in-ear headphone, it's important to get a tight seal because you lose a lot of bass if you don't (and one of the appeals of this headphone is that it does offer a lot of bass). I spent some time comparing this model to the LG Tone Infinim HBS-900, which I liked a lot and carries a street price of around $125 and sometimes less. In terms of design, it's hard to declare a clear winner. Both are designed to worn around all day and make you forget you're wearing them when you're not using them. That said, there are things I like about the Sol Republic and things I like about the LG Tone Infinim.The Infinim has retractable earbuds, which is a pretty nifty feature. That means that when you're not using the headphones you don't have to leave the earbuds dangling down like you do with the Sol Republics. It's unclear how durable the retraction mechanism is -- and the Infinim's cords are thin -- but I liked the feature a lot.It's hard to say which headphone is more comfortable to wear. They're both good. I did have a slight preference for the Sol Republic when I was wearing a T-shirt (no collar) because I think the flexible nature of the band and its softer, more rubberized plastic can end up feeling better against your skin than the more rigid, hard plastic of the LG. But it's not a big difference either way.As far as the button layout goes, I'd give a slight edge to LG, which has more buttons, including a dedicated on/off button and pause/play button, but they are clearly labeled and easy to operate by feel. While there's nothing wrong with the Sol Republic's buttons, the headphone has a uniform shape and is all one color, so it's sometimes hard to tell right from left and top from bottom. The best way to do that is to make sure the subdued Sol Republic logo on the left side is right-side up.", "title": "Sweet-sounding in-ear Bluetooth headphones at a great price"},
{"url": "http://www.cnet.com/products/canon-eos-m3/", "sitename": "Cnet", "datetime": "2015-05-04T13:15:00-0700", "body": " Canon's M3, the company's most recent foray into the growing mirrorless ILC market, is its most promising. Canon's first entry, 2012's EOS M, had widely-reported autofocus issues that turned off many customers before a firmware update addressed the problem. Its successor, the EOS M2, was only released in Japan and China. The third in the series looks to overcome the stumbling blocks of its predecessors, but the real question is whether the M3's respectable specs and DSLR-quality snapshots can make up for its lacklustre lineup of dedicated lenses, and a lesser feature set than closely priced competitors. The M3 is available in the European and Australian markets (while the US remains noticeably absent). Price-wise, the UK and Europe are looking to pay £600 or €770, while Australians can find it for around AU$900 for the kit with the 18-55mm IS STM lens.Image quality Image quality is as good as any of Canon's high-end APS-C DSLRs. Even with a 24.2-megapixel sensor, the camera does a very good job of controlling noise. Colours show good saturation and sharpness at such high resolutions. Most would rarely need all that extra resolution but it does allow a lot of latitude for cropping if the composition was a little off. More than likely though you'll find it comes in handy for cropping subjects because your zoom lens just doesn't reach far enough.Samples Canon EOS M3 sample photos See full gallery 1 - 2 / 8 Next Prev The M-mount 18-55mm IS STM lens that comes with the kit is a solid offering. Like most consumer kit lenses, it doesn't offer a very wide constant aperture at f3.5-5.6. Lens distortion isn't bad by any measure and it handles aberrations well. Canon knows what it's doing with lens design and the 18-55mm IS lens performs well when coupled with the M3's sensor. Luckily performance is mostly up to par, since the camera relies on the 18-55mm as it's one of only four lenses available for the M-series mount. Enlarge ImageAt lower ISOs JPEGs hold up well Dave Cheng/CNET Enlarge ImageAt ISO 3200 onwards details degrade but images are very usable. Dave Cheng/CNET Enlarge ImageThe original framing for the test shots Dave Cheng/CNET Enlarge ImageWithout the EOS-EF M adapter and an EF mount Sigma 50mm f/1.4 Art lens this shot would not have been possible. Dave Cheng/CNET Coupled with the optional Mount Adapter EF-EOS M (roughly £99, AU$130) and Sigma's 50mm f/1.4 Art, the M3 was able to show off its low-light capabilities. Shooting at ISO 6400 produces usable night photos like the cat lit by a street light. It really highlights the strength of Canon's sensor when paired with a quality lens. JPEG processing emphasises bringing out additional detail in the shadows. Raw files display more contrast whereas the JPEGs aim for a more balanced exposure. There's also some mild noise reduction in the JPEGs that smooth out some of the grain, even at lower sensitivities such as ISO 200. For anyone looking to get the maximum amount of detail in their files, a 6,000 x 4,000 raw file provides ample resolution and latitude for editing. window.console && console.log && console.log(\"ADS: queuing leader-plus-middle-554d16c0c7ab4 for display\"); var cbsiGptDivIds = cbsiGptDivIds || []; cbsiGptDivIds.push(\"leader-plus-middle-554d16c0c7ab4\"); Enlarge ImageJPEG processing places a greater emphasis on bringing out details in the shadows. You can also see the lens distortion it corrects for on the left and top. Dave Cheng/CNET Video on the M3 is not its strong point. Tracking and continuous autofocus does a great job of following moving subjects, but through the kit lens it's all somewhat flat, and the only way you can get the most out of the video autofocus is with one of the few STM (stepper motor) lenses. The 3.5mm mic input should help with sound recording but there's no audio output for monitoring sound.Design and features View full gallery (9 Photos)The M3's grip strikes the right balance between size and usability Dave Cheng/CNET Build quality is on par with Canon's magnesium alloy DSLRs, though without the weather sealing. The magnesium alloy/stainless steel body doesn't creak when gripped tightly like cameras made of plastic are prone to. The recessed grip strikes a nice balance between usefulness while maintaining a low profile. The vulcanised rubber gives it the familiar feel of a DSLR and the body itself takes many of its cues from Canon's DSLRs. Shutter speed and aperture have dedicated dials while ISO is an easy press of the combined directional pad/toggle wheel located at the thumb. With no manual focus switch on the lens, MF is selectable via the thumb dial along with flash modes. Those familiar with Canon's menu system of the past few years will find the M3 easy to navigate. Users can also customise their own menu with up to six selections for menu options they find themselves frequenting. The touch screen offers a sharp view of the scene. It's easy to use and responsive but all functionality is also available via the dials. Where the touch screen comes into its own is in selecting a focus point. It's fast and accurate, and while navigating the menu and changing the exposure is often better via the dials, selecting focus is overwhelmingly faster with a tap of the screen. The quick menu button on the top right hand of the touch screen offers fast access to AF mode, image size and quality, movie recording quality, self-timer, white balance, metering and aspect ratio. It saves on menu-diving and streamlines the shooting experience. The articulated screen also comes in handy and offers three alternative shooting styles. The screen can angle 45 degrees downwards for holding the camera up which works well for the street photographers or those looking to shoot from a lower angle. Paired with the self-timer function and the screen rotated 180 degrees and it's ready to take the next selfie. View full gallery (9 Photos)Remote shooting with the 'EOS Remote' app Dave Cheng/CNET ", "title": "Finally, a Canon ILC that's as good its competitors"},
{"url": "http://www.cnet.com/products/canon-powershot-sx410-is/", "sitename": "Cnet", "datetime": "2015-02-05T20:00:12-0800", "body": " Canon Though you may be in love with your smartphone's camera, its lens will never match the capabilities of the Canon PowerShot SX410 IS.Backed by Canon's Intelligent IS image stabilization system, the SX410 has a 40x f3.5-6.3 24-960mm zoom lens -- a tremendous range for a camera that is only 3.35 inches (8.5cm) deep.The CCD sensor behind the lens is capable of capturing 20 megapixel stills and 720p HD video. However, if you're looking for manual control over shutter speed or aperture, this is not the camera for you. Canon The SX410 IS is set up for automatic shooting including the company's Smart Auto that intelligently selects settings based on 32 predefined scene modes (21 are used when capturing movies). You'll also find a large assortment of creative effects options including favorites like Toy Camera and Miniature.The Canon PowerShot SX410 IS camera arrives in March in red or black versions for $279.99. Pricing wasn't available for the UK and Australia, but it converts to £185 and AU$360. ", "title": "Canon PowerShot SX410 IS a compact 40x zoom for auto shooters"},
{"url": "http://www.cnet.com/products/xiaomi-yi/", "sitename": "Cnet", "datetime": "2015-03-26T15:09:00-0700", "body": " Among all of the smartphone and wearable tech news that came out of 2015's Mobile World Congress was a surprise from Chinese electronics brand Xiaomi -- the tiny Yi action cam.Outside of China the company is best known for its smartphones, but it has a growing lineup of related devices such as the Mi Band fitness tracker and headphones that it's been putting the Xiaomi name on.The Yi is one of those, continuing its expansion into other categories beyond smartphones (not unlike what HTC did last year with the Re camera) and further building its reputation for offering products with high-end features at budget-friendly prices. Though it's primarily available in China for 399 yuan, you can buy one for just under $100 (about £65 and AU$120) from online retailers like GearBest.com, which is where we got ours. That price isn't quite as good as the converted price of about $65, but is still excellent for what you're getting. View full gallery (21 Photos) Sarah Tew/CNET Out in front of the little lime green and teal box (it's available in all white, too) is a nice f2.8 wide-angle lens with a 155-degree angle of view, while inside is a Sony-made 16-megapixel backside-illuminated CMOS sensor, a Broadcom wireless module and an Ambarella A7LS system on a chip (SoC) running the show. To give you some perspective, Ambarella's chips can be found in many POV cameras and DJI's quadcopters and, more specifically, the GoPro Hero3+ Silver, Ion Air Pro 3 and Drift Innovation Ghost-S use the A7LS chip family. Aside from the SoC, those cameras all have one other thing in common: prices of $300 or more. Now, those cameras do offer things that the Yi doesn't, but it's because of what it does have that the Yi can do more than others at its price such as the Polaroid Cube and Monoprice MHD 2.0. Also, although the slightly more expensive entry-level GoPro Hero has very good video quality, the Yi still beats it there and on features and, depending on your needs, design. View full gallery (21 Photos) Sarah Tew/CNET window.console && console.log && console.log(\"ADS: queuing leader-plus-middle-554d177132782 for display\"); var cbsiGptDivIds = cbsiGptDivIds || []; cbsiGptDivIds.push(\"leader-plus-middle-554d177132782\"); Features and designFor starters, the higher-end specs mean it can capture 1080p video at 60, 48, 30 or 24 frames per second (fps); 960p (also called tall HD) at 60 or 48fps; 720p at 120, 60 or 48fps; and 480p at 240fps. It can also snap pictures at resolutions up to 16 megapixels one at a time; in bursts at 3, 5 or 7fps or 7 frames over 2 seconds; or at time intervals of 0.5, 1, 2, 5, 10, 30 or 60 seconds. You can also set up a self-timer for 3, 5, 10 or 15 seconds. There's also a Snapshot mode that captures 10 seconds of VGA-quality video for quick social sharing.Other cameras at the Yi's price offer a fraction of those options and typically record video at a maximum of just 1080p at 30fps and 720p at 60fps. However, unless you read Chinese, using the camera to do all that it can do is a little tricky at first. Again, this camera is made for the Chinese market, so the instructions that come with it are in Chinese. If you've used a similar action cam or aren't afraid to press buttons, the Yi is simple to figure out. If you haven't or are afraid, well, it's still easy. View full gallery (21 Photos) Sarah Tew/CNET The camera has three buttons. The one on front is for power and switching between capturing stills and video. (The defaults, by the way, are single, 16-megapixel photos and 1080p at 30fps.) A button on top is the shutter release and for starting and stopping recordings. On the left is a small button for turning on and off the camera's wireless. There are record lights on the top, back and bottom and a light around the power button gives you a battery status by changing color. On back you'll find a door for the battery compartment and another covering the microSDXC card slot, Micro-USB port and Micro-HDMI output. A battery and short Micro-USB cable are included for charging and transfers, but you're on your own for storage; it supports cards up to 128GB. If you're looking for the cut corners that got the price so low, the lack of included accessories is one of them. There is no polycarbonate waterproof housing and the camera isn't waterproof without one. View full gallery (21 Photos) Sarah Tew/CNET ", "title": "A higher-end action cam with an entry-level price"},
{"url": "http://www.cnet.com/products/fujifilm-finepix-s9900w/", "sitename": "Cnet", "datetime": "2015-01-14T21:01:07-0800", "body": " Fujifilm Fujifilm continues to whittle its FinePix line of point-and-shoots down to just essentials. At the moment this includes making just minor updates to existing megazoom and rugged cameras. The new FinePix S9900W (US only) and S9800 are tweaks to 2014's S9400W and S9200. The updates share their predecessors' 16-megapixel CMOS sensor, 50x f2.9-6.5 24-1,200mm lens (35mm equivalent) and abundant shooting options including 10-frames-per-second burst shooting, full-manual and semimanual modes and full HD movie capture. What's been added is five-axis image stabilization (two-axis optical and three-axis electronic stabilization) to help with camera shake in all directions and should be especially helpful when taking advantage of its 1,200mm focal length. Fujifilm also significantly increased the resolution on the electronic viewfinder from 200K dots to 920K dots, which should make subjects and onscreen settings sharper and easier to see. The difference between the two models is Wi-Fi: the FinePix S9900W has it, the S9800 doesn't. Both cameras will be available in March for $349.95 and $329.95, respectively. Pricing for the UK and Australia wasn't available for the S9800, but it converts to £230 and AU$430. Fujifilm Joining the S-series models is the FinePix XP80, an ultracompact rugged camera that's waterproof to 50 feet (15m), shockproof from 5.8 feet (1.75m), freezeproof to 14 degrees Fahrenheit (-10 degrees Celsius) and dustproof. By comparison, its predecessor the XP70, is waterproof to 33 feet (10m) and shockproof from 5 feet (1.5m).It, too, features a 16-megapixel CMOS sensor, but with a 5x 28-140mm zoom lens and has built-in Wi-Fi for transferring photos and movie clips to smartphones and tablets and remote control of the camera. The camera also has an Action Camera mode that, when paired with the ACL-XP70 lens, gives you a superwide field of view of 18mm (35mm equivalent).The Fujifilm FinePix XP80 arrives in March for $229.95. Pricing for UK and Australia were not available, but it converts to £150 and AU$280. ", "title": "Fujifilm improves stabilization on 50x zoom FinePix S9900W, makes tougher FinePix XP80"},
{"url": "http://www.cnet.com/products/sharp-ht-sb602-sound-bar-system-for-home-theater-wireless/", "sitename": "Cnet", "datetime": "2015-02-24T14:45:00-0800", "body": "In the past 12 months we've seen some terrific values in sound bars, with the Yamaha YAS-203 and the Pioneer SP-SB23W in particular offering amazing performance for the money.The Sharp HT-SB602 is part of a very competitive field, and it offers a couple of interesting features for the money, including HDMI switching with DTS decoding and Bluetooth streaming. Cosmetically the main unit looks decently stylish with its two-tone metallic finish, but the subwoofer is a little unfinished-looking. And it's really, really wide.The Sharp's \"movie-only\" sound balance means it isn't quite as good for music as the 'bars mentioned above, so overall it's not our favorite sound bar for the money. That said, its sheer physical breadth makes it well-suited to owners of 60-inch-or-so TVs who don't mind its sonic limitations.View full gallery (17 Photos) Sarah Tew/CNET The HT-SB602's cosmetics mimic the steel-gray appearance of the company's TVs. That makes sense because you will probably be buying this sound bar as part of a Sharp bundle deal, or to go with a Sharp TV, rather than seeking it out separately.At 54.5 inches across, the HT-SB602 is quite wide for a sound bar, though it's not as tall as some, at 2.9 inches high.View full gallery (17 Photos) Sarah Tew/CNET The unit features two sets of twin metallic drivers across the front and a small LED display in the middle.View full gallery (17 Photos) Sarah Tew/CNET The separate sub is side-firing and features a frankly gaudy plastic port and large \"NFC\" badge. While competitors offer finished backs on their subs, the bare-MDF finish on the Sharp looks cheap. Good thing it will likely be facing a wall.View full gallery (17 Photos) Sarah Tew/CNET The remote control stands out from the pack of credit-card-style clickers by being surprisingly well-featured and reasonably easy to use.The HT-SB602 is a stereo sound bar that features a wireless subwoofer and it is capable of a claimed 80W per channel and 150W output, respectively.View full gallery (17 Photos) Sarah Tew/CNET ", "title": "Slick sound bar goes wide"},
{"url": "http://www.cnet.com/products/audio-technica-ath-msr7/", "sitename": "Cnet", "datetime": "2015-04-12T04:00:02-0700", "body": "Audio-Technica's ATH-M50 and subsequent ATH-M50x have long been among the best sounding headphones for the money with a price tag of around $150 online. And while the company has plenty of other headphones in its line, it hasn't had a killer step-up model to go up against popular \"premium\" closed-back over-ear headphones in the $250-$300 range.The ATH-MSR7 may just be that headphone. Priced at $250 (£199, AU $349) and available in a few different color options, it features rich, highly detailed sound, is well-built, should fit most people comfortably and comes with three cables, including one that has an inline remote/microphone for cell-phone use.View full gallery (12 Photos)The ATH-MSR7 comes in black and a few other colors. Sarah Tew/CNET The ATH-MSR7 shares some familial resemblance with the ATH-M50x, but it's a sleeker-looking headphone and has more plushly padded earcups. In terms of competing products, its design is in the same vein as Sony's MDR-1R and MDR-1A, but those two models are lighter and more comfortable to wear over long sessions. The ATH-MSR7 weighs 290 grams, while the MSR-1A weighs 225 grams.The ATH-50x has a detachable cord and comes with additional cords of varying lengths. However, staying true to its studio monitor roots, it doesn't come with a cord that has an integrated remote and microphone, whereas the ATH-MSR7 does. You also get two standard straight cables 1.2 meters (3.9 feet) and 3 meters (9.8 feet) in length.Additionally, the headphones come with simple black protective vinyl carrying bag that's similar to the one that ships with the ATH-50x. It's nothing fancy, but it serves its purpose.View full gallery (12 Photos)What you get in the box. Sarah Tew/CNET There's a lot of energy and life to the sound of the ATH-MSR7. It's the sort of sound that gets strong reactions from listeners. There's a lot of clarity, so you feel a strong connection to the music, but it's also the kind of headphone that's not shy about revealing harshness or distortion in recordings.The best recordings benefit from the ATH-MSR7's vivid character, so with bluesman Doug MacLeod's new \"Exactly Like This\" album sounded utterly live and the ATH-MSR7 could do no wrong. After we listened for a half an hour we started to feel that the ATH-MSR7's earpads' pressure was a little too high. As we said, it's not as comfortable a headphone as Sony's MDR-1R, which has softer, more laid-back highs and fuller lows.", "title": "The lowest-priced (true) high-resolution headphone"},
{"url": "http://www.cnet.com/products/sennheiser-urbanite-xl-wireless/", "sitename": "Cnet", "datetime": "2015-05-04T15:10:00-0700", "body": " As part of its 2015 line of headphones, Sennheiser is serving up a few different wireless headphones, many of which are based on earlier wired models. Such is the case for the Urbanite XL Wireless, which follows in the footsteps of last year's wired Urbanite XL and carries a list price of $300 (£250, AU$400). It currently only comes in black, but more color options should arrive in the future. Sennheiser's Urbanite line is designed to have a little more urban flare to it and appeal to the Beats audience. This model looks very similar to the wired Urbanite XL that we liked, but this model gives you the option of going wired or wireless and has touch controls on the right ear cup. Tap the side of the headphone once and your music pauses or plays (the touch interface is quite sensitive). Tap twice and you advance a track forward. Swipe up and down to control volume. Enlarge ImageThe headphone has touch controls on the right ear cup. Sarah Tew/CNET Some people don't like these types of touch controls because you can end up accidentally touching the side of the headphone and interfering with music playback. But the touch controls worked well for me, even if I did have a few accidental pauses from time to time, particularly when I went to adjust the headphone on my head. While made mostly of plastic, the Urbanite XL Wireless does have metal hinges, seems sturdily built and folds up into a more compact form factor. They come with a carrying pouch, but it's pretty skimpy, which is a little disappointing. As far as other extras go, near-field communications (NFC) tap-to-pair technology and aptX, which is supposed to offer enhanced Bluetooth sound with smartphones that support it. The headphone also has dual microphones, so you can hear your voice in the headphone when you're using it as a cell-phone headset. This model doesn't feature active noise-canceling like the Beats Studio Wireless and Sennheiser's more expensive Momentum Wireless. But sound isolation is decent and the headphones are comfortable to wear. Battery life is rated at a strong 25 hours of music playback and the headphones come with a 2-year warranty, which is a year more than the warranty that you get with most headphones.", "title": "A dynamic Bluetooth headphone"},
{"url": "http://www.cnet.com/products/loop-labs-notion/", "sitename": "Cnet", "datetime": "2015-05-05T15:40:00-0700", "body": " Loops Labs Editors' Note, May 7, 2015: The Co-Founder of Notion, Brett Jurgens, responded to some of the setup questions I had. I've updated the piece accordingly.Between detecting leaks, watching the front door, and listening for smoke alarms, the smart home is getting pretty versatile. The right system with the right configuration of sensors can act as a capable sentry, keeping a precise eye on whatever you deem valuable. An upcoming sensor called Notion from tech startup Loop Labs wants to take the guesswork out of picking the lineup of sensors that's right for you.Notion is a small white disc with a sticky back that you can place anywhere, and with eight different ways of detecting the environment around it, Loop Labs hopes this one gadget can take care of all of your security concerns.Notion had a successful Kickstarter campaign last fall, and now the system is available for preorder on Loop Lab's site. In addition to the puck shaped sensors, you'll need to buy a rectangular bridge that receives the signal from your sensors and sends them to your Wi-Fi router. Almost all packages on the site include both. The starter pack with one of each is currently available for $130. Loop Labs expects the Notion to start shipping in July.You won't find motion sensors or a camera in Notion's bag of tricks, but given its seemingly small size, Loop Labs has packed in an impressive amount of functionality. By sensing acceleration, orientation, and proximity, it can tell whether your door is open or closed. It can also listen for smoke alarms and the doorbell. Notion will let you know when the door opens, and it can listen for the smoke detector as well. Loop Labs Supposedly, it can detect specific frequencies so you won't receive false alarms with every loud noise, but I wonder how much time it'll take for it to properly learn which sounds are important -- doorbells tend to be different from home to home -- and how much work you'll have to do to teach it those sounds.Notion's co-founder, Brett Jurgens, assured me it wouldn't take long, \"Our proprietary logic interprets different sounds and learns over time with no required interaction from the user. We have done a considerable amount of testing to be able to ensure we can delineate between a smoke alarm going off, a baby crying, a dog barking and a doorbell ringing... Through the combination of sensors, we are able to see paired actions like -- possible doorbell + door opens = very high likelihood the sound was a doorbell.\"I also thought you'd have to teach your Notion whether your door was open or closed. Since you can place it anywhere, it made sense to me that you'd have to tell it which orientation was which. Again, Jurgens promised the sensor was up to the task, and it can tell based on the sound and the vibration when you close your door.All of this sounds great, as does that fact that a single sensor can watch the door while monitoring the temp and listening for smoke alarms. I still have my doubts that a device could do this all so seamlessly.The advantage with a single function device is that it'll know right away what it's supposed to do, and I wonder if Notion will be able to keep up with the dedicated and specific sensors in a complete and reputable system like SmartThings.You'll need this bridge to connect your sensors to the cloud. Loop Labs If you're a fan of customization, though, the Notion looks to have you covered. Each device can multitask or focus on one thing, depending on your settings. In the video on its site, the basic setup looks easy enough. Plug the bridge into an outlet, connect it to your Wi-Fi, then sync up each Notion sensor with your phone. It's compatible with both iOS and Android. From there, the sensor will automatically send you notifications based on its preset thresholds and all eight of its sensors. For example, it'll alert if the temperature moves out of its default range of 60 to 80 degrees Fahrenheit right away, but if you want Notion watching your wine cellar, you can refine that range.Loop Labs has even primed Notion to be part of a larger smart home. The website promises to be fully compatible with both Apple's upcoming HomeKit and the \"Works with Nest\" program by launch.The coin cell batteries powering each device supposedly last up to two years, and can communicate with a bridge at a distance of up to 175 feet. You'll need more than one sensor if you want to watch the front door, track the garage door, and have one under the sink to detect leaks. Loop Labs has sensor bundles as well, and each bridge can communicate with multiple Notions.Buying a bunch of Notions to cover every area of your house might not be any more cost effective than buying sensors for SmartThings or Wink. Loop Labs will need to multitask effectively and make sure its multitasker is easy to use to gain ground on its already established competition.The company has made big promises to that end and about how much it can know right out of the box. Despite its elegant look, Notion looks to have quite a bit of complexity under the surface. If it really can act as a do-it-all sensor and learn quickly on the job, it could be worth a look as a smart home swiss army knife.", "title": "A Notion to streamline smart home sensors"},
{"url": "http://www.cnet.com/products/samsung-chef-collection-rf34h9960s4-refrigerator-freezer-bottom-freezer-freestanding-stainless-steel/", "sitename": "Cnet", "datetime": "2015-04-01T14:19:00-0700", "body": " Fancy a new fridge? Have six grand? Then, behold, the Samsung Chef Collection Refrigerator, model RF34H9960S4. Priced well above anything else offered by the top manufacturers, the Chef Collection fridge is as high-end as refrigerators come -- at least before you start throwing around names like Viking and Sub-Zero. That last bit is the really important part, as the Chef Collection seeks to bridge the fridge gap between high end and ultra-high end. Competing top-of-the-line models from the other major brands typically cost thousands less, but put the Chef Collection fridge up against the niche fridges from those aforementioned luxury brands -- which cost thousands more -- and the appeal of this Samsung unit starts to appear. Along with a bevy of unique features drawn from the input of world-class chefs (per Samsung's marketing, at least), the Chef Collection fridge boasts a whopping 34 cubic feet of storage and a premium, \"t-type\" build. Though it wasn't as strong a performer as I would expect from a $6,000 fridge, it's steady enough (and stylish enough) to deserve strong consideration alongside fancier fridges that sell for even more. Enlarge Image Tyler Lizenby/CNET Almost every refrigerator is going to be a big, blocky behemoth in your kitchen, but the Chef Collection fridge is downright monolithic. Cue the orchestra. At 36 inches wide, 36 inches deep, and 6 feet tall, this thing is a kitchen Goliath, ringing in with a total capacity of 34.3 cubic feet, 19 of which make up the refrigeration compartment. If that's not enough of a space odyssey for your needs, you can transform the bottom right quadrant from freezer into fridge with just a few taps on the in-door control panel. Enlarge ImageYou'll need to open the fridge in order to access the in-door controls. Tyler Lizenby/CNET Those in-door controls were a sticking point for some in our test lab, as they require you to open a door in order to use them. I was less bothered -- you'll probably rarely use the controls, and basic info like the running temperature is available right on the front of the fridge by means of a slick-looking set of LEDs that disappear altogether when not in use. Make no mistake, the focus here is on design, and Samsung is betting that design-minded shoppers would rather have those controls neatly out of sight at a slight inconvenience than have them cluttering up the streamlined build for usability's sake. Given that this is a $6,000 fridge, I think that's a smart bet. People are going to buy this thing to make their neighbors jealous, not because they need their refrigerator to be more intuitive. It's a rare instance where form over function was probably the right call. Enlarge Image Tyler Lizenby/CNET The Chef Collection's emphasis on design is literally front and center here, with a semi-unique \"t-type\" build that splits both fridge and freezer right down the middle, creating a sort of hybrid between French door and side-by-side stylings. Recessed handles only serve to reinforce the split-faced design, an especially elegant touch that immediately gives the Chef Collection fridge a good deal of luxury cred. Looking it over, it's a challenge not to be impressed. Other features, on the other hand, are geared almost exclusively towards usability. Though you won't find a touchscreen or any other marquee smart features, the Chef Collection fridge does quietly boast smart grid compliance for users who live in areas that allow you to automate your refrigerator's defrost cycles to run when the energy rates are at their lowest.The fridge also comes with a pair of stainless steel \"Chef Pans\" that slide neatly into place below the refrigerator shelving -- a product of the Chef Collection's \"Club des Chefs\" brain trust. Use one to marinate a steak, and you'll be able to transfer the entire pan straight into the oven, then on into the dishwasher after your meal. You'll notice other foodie-friendly features throughout the fridge, too, including the \"Chef Basket,\" an in-door shelf designed to hold grated cheese, sliced veggies and other prep ingredients. When you're ready to start cooking, it comes right out to join you. There's also the \"Chef Pantry,\" a wide drawer below the crisper bins that's designed to hold delicate items like meat and fish at an optimized temperature.You can even load a SodaStream carbonator directly into the fridge door, then dispense sparkling water on demand. Switching carbonators is a quick, easy process, though you do need to wait 20 minutes or so before you can begin dispensing the stuff. Flip the sparkling water lever back up, and you'll be back in ice-dispensing mode, with an ice maker that, to my ear, seemed a bit quieter than the average fridge. All in all, the Chef Collection refrigerator claims about as many high-end features as you'll find in a fridge, including enough unique ones (and enough that seem legitimately useful) to keep things compelling. Pair that with a design that swings for the fences, and you've got an appliance that looks and feels farther ahead of the curve than almost any other model we've looked at. Enlarge Image Jared Hannah/CNET Let's say you currently own a fridge that you spent $1,500 on, and that you're more or less happy with its performance. How much better would you expect a $6,000 fridge to perform? If you answered \"four times better,\" then you might come away disappointed with the Samsung Chef Collection fridge. That isn't to say that its cooling performance is disappointing in and of itself, but it doesn't blow less expensive fridges out of the water, either. Some, like the $4,000 LG LMXS30776S, even manage to outperform it, with internal temperatures that fall closer in line with the selected running temperature.", "title": "Meet the $6,000 fridge that might just be worth it"},
{"url": "http://www.cnet.com/products/sennheiser-urbanite-xl-wireless/", "sitename": "Cnet", "datetime": "2015-05-04T15:10:00-0700", "body": " As part of its 2015 line of headphones, Sennheiser is serving up a few different wireless headphones, many of which are based on earlier wired models. Such is the case for the Urbanite XL Wireless, which follows in the footsteps of last year's wired Urbanite XL and carries a list price of $300 (£250, AU$400). It currently only comes in black, but more color options should arrive in the future. Sennheiser's Urbanite line is designed to have a little more urban flare to it and appeal to the Beats audience. This model looks very similar to the wired Urbanite XL that we liked, but this model gives you the option of going wired or wireless and has touch controls on the right ear cup. Tap the side of the headphone once and your music pauses or plays (the touch interface is quite sensitive). Tap twice and you advance a track forward. Swipe up and down to control volume. Enlarge ImageThe headphone has touch controls on the right ear cup. Sarah Tew/CNET Some people don't like these types of touch controls because you can end up accidentally touching the side of the headphone and interfering with music playback. But the touch controls worked well for me, even if I did have a few accidental pauses from time to time, particularly when I went to adjust the headphone on my head. While made mostly of plastic, the Urbanite XL Wireless does have metal hinges, seems sturdily built and folds up into a more compact form factor. They come with a carrying pouch, but it's pretty skimpy, which is a little disappointing. As far as other extras go, near-field communications (NFC) tap-to-pair technology and aptX, which is supposed to offer enhanced Bluetooth sound with smartphones that support it. The headphone also has dual microphones, so you can hear your voice in the headphone when you're using it as a cell-phone headset. This model doesn't feature active noise-canceling like the Beats Studio Wireless and Sennheiser's more expensive Momentum Wireless. But sound isolation is decent and the headphones are comfortable to wear. Battery life is rated at a strong 25 hours of music playback and the headphones come with a 2-year warranty, which is a year more than the warranty that you get with most headphones.", "title": "A dynamic Bluetooth headphone"},
{"url": "http://www.cnet.com/products/loop-labs-notion/", "sitename": "Cnet", "datetime": "2015-05-05T15:40:00-0700", "body": " Loops Labs Editors' Note, May 7, 2015: The Co-Founder of Notion, Brett Jurgens, responded to some of the setup questions I had. I've updated the piece accordingly.Between detecting leaks, watching the front door, and listening for smoke alarms, the smart home is getting pretty versatile. The right system with the right configuration of sensors can act as a capable sentry, keeping a precise eye on whatever you deem valuable. An upcoming sensor called Notion from tech startup Loop Labs wants to take the guesswork out of picking the lineup of sensors that's right for you.Notion is a small white disc with a sticky back that you can place anywhere, and with eight different ways of detecting the environment around it, Loop Labs hopes this one gadget can take care of all of your security concerns.Notion had a successful Kickstarter campaign last fall, and now the system is available for preorder on Loop Lab's site. In addition to the puck shaped sensors, you'll need to buy a rectangular bridge that receives the signal from your sensors and sends them to your Wi-Fi router. Almost all packages on the site include both. The starter pack with one of each is currently available for $130. Loop Labs expects the Notion to start shipping in July.You won't find motion sensors or a camera in Notion's bag of tricks, but given its seemingly small size, Loop Labs has packed in an impressive amount of functionality. By sensing acceleration, orientation, and proximity, it can tell whether your door is open or closed. It can also listen for smoke alarms and the doorbell. Notion will let you know when the door opens, and it can listen for the smoke detector as well. Loop Labs Supposedly, it can detect specific frequencies so you won't receive false alarms with every loud noise, but I wonder how much time it'll take for it to properly learn which sounds are important -- doorbells tend to be different from home to home -- and how much work you'll have to do to teach it those sounds.Notion's co-founder, Brett Jurgens, assured me it wouldn't take long, \"Our proprietary logic interprets different sounds and learns over time with no required interaction from the user. We have done a considerable amount of testing to be able to ensure we can delineate between a smoke alarm going off, a baby crying, a dog barking and a doorbell ringing... Through the combination of sensors, we are able to see paired actions like -- possible doorbell + door opens = very high likelihood the sound was a doorbell.\"I also thought you'd have to teach your Notion whether your door was open or closed. Since you can place it anywhere, it made sense to me that you'd have to tell it which orientation was which. Again, Jurgens promised the sensor was up to the task, and it can tell based on the sound and the vibration when you close your door.All of this sounds great, as does that fact that a single sensor can watch the door while monitoring the temp and listening for smoke alarms. I still have my doubts that a device could do this all so seamlessly.The advantage with a single function device is that it'll know right away what it's supposed to do, and I wonder if Notion will be able to keep up with the dedicated and specific sensors in a complete and reputable system like SmartThings.You'll need this bridge to connect your sensors to the cloud. Loop Labs If you're a fan of customization, though, the Notion looks to have you covered. Each device can multitask or focus on one thing, depending on your settings. In the video on its site, the basic setup looks easy enough. Plug the bridge into an outlet, connect it to your Wi-Fi, then sync up each Notion sensor with your phone. It's compatible with both iOS and Android. From there, the sensor will automatically send you notifications based on its preset thresholds and all eight of its sensors. For example, it'll alert if the temperature moves out of its default range of 60 to 80 degrees Fahrenheit right away, but if you want Notion watching your wine cellar, you can refine that range.Loop Labs has even primed Notion to be part of a larger smart home. The website promises to be fully compatible with both Apple's upcoming HomeKit and the \"Works with Nest\" program by launch.The coin cell batteries powering each device supposedly last up to two years, and can communicate with a bridge at a distance of up to 175 feet. You'll need more than one sensor if you want to watch the front door, track the garage door, and have one under the sink to detect leaks. Loop Labs has sensor bundles as well, and each bridge can communicate with multiple Notions.Buying a bunch of Notions to cover every area of your house might not be any more cost effective than buying sensors for SmartThings or Wink. Loop Labs will need to multitask effectively and make sure its multitasker is easy to use to gain ground on its already established competition.The company has made big promises to that end and about how much it can know right out of the box. Despite its elegant look, Notion looks to have quite a bit of complexity under the surface. If it really can act as a do-it-all sensor and learn quickly on the job, it could be worth a look as a smart home swiss army knife.", "title": "A Notion to streamline smart home sensors"},
{"url": "http://www.cnet.com/products/eureka-brushroll-clean-upright-vacuum-with-suctionseal-as3401a/", "sitename": "Cnet", "datetime": "2015-04-24T10:48:00-0700", "body": " Eureka Eureka's borrowing a page from its parent company's playbook, with a new upright vacuum that boasts the same \"Brushroll Clean\" feature as one of our favorite Electrolux models. Available exclusively at Wal-Mart, the Eureka Brushroll Clean sells for just under $200, promises to manage tangles as well as the Electrolux model of the same name, and claims to clean carpets better than the Dyson DC41, too.That last bit isn't as bold a claim as it might sound -- the Electrolux Precision Brushroll Clean was already able to best the DC41's carpet-cleaning performance in our sand and sawdust tests, and held its own with pet hair and crushed cereal, as well. I'd expect the Eureka model's performance to fall in the same ballpark, though we'll see for sure when we test the thing out for a full review. Eureka To use the Brushroll Clean feature, you'll just step on a pedal on the back of the vacuum while the brushroll is spinning. Any tangled hairs should get cut away within a few seconds. It's a feature we enjoyed when we tested the Electrolux version out, as it saved us from having to get down on our hands and knees with a pair of scissors to cut tangles away by hand.The Brushroll Clean also boasts Eureka's \"AirSpeed\" and \"SuctionSeal\" features. The former simply means that the flow of air from floor to bin is designed to be as short, straight, and efficient as possible. As for SuctionSeal, it indicates the vaccum's ability to raise or lower the head to maximize suction against whatever floor it is that you're cleaning.The Eureka Brushroll Clean is available now as a Wal-Mart exclusive for $198. Expect to see it mixed in with our next crop of vacuum reviews.", "title": "Eureka's new vacuum takes care of tangles"},
{"url": "http://www.cnet.com/products/pentax-k-s2/", "sitename": "Cnet", "datetime": "2015-05-01T11:56:00-0700", "body": " Ricoh has been plugging away in the consumer dSLR space, even using flashing lights and a cornucopia of colors to attract first-time and family buyers to its Pentax models, away from more staid Nikons and Canons. With the K-S2, the company combines Pentax's two-tone tendencies and colored lights with a more staid design sensibility and the weather-sealed body, large viewfinder and solid photo quality that have long been the hallmarks of Pentax's entry-level cameras. The result is a really nice option, with a single big weakness: video capture.Image quality Overall, the photos look excellent. JPEGs are clean up to ISO 800 -- ISO 1600 in good light. Beyond that, they get soft fast. Color is very good; bright and saturated yet still accurate in its default Bright setting. Auto white balance is generally good, though in indoor lighting, photos develop a yellowish/pinkish cast, depending upon the light sources. Pentax K-S2 photo samples See full gallery 1 - 5 / 7 Next Prev At press time, the only raw support for the K-S2 was the bundled SilkyPix software, and as far as I can tell there isn't a lot of detail you can recover from blown-out highlights without simply turning them brown, though you can bring up shadows without introducing too much noise. (Unfortunately, despite its popularity as a bundle choice, SilkyPix is -- at best -- impenetrable. Nor can you save as DNG for use in another program. I saved as a 16-bit TIFF file and used that in Lightroom .) The big disappointment here is the video quality. If you leave shake reduction on, which most people probably want to do, the movies have a bad case of the wobbles; not just typical horizontal jello (rolling shutter), but vertical as well. If you turn off the SR, the wobbles go away but then it's got the shakes. Those issues aside, video also suffers from serious moire -- brick buildings in the background are covered in not-so-groovy rainbows. The camera has Pentax's AA-filter simulator, which defeats the moire that results from removing the anti-aliasing filter from the sensor (which blurs the image just a bit in exchange for removing visual errors from high-frequency patterns). The simulator shifts the sensor slightly for a second shot and combines the two to cancel out the patterns. Unfortunately, the AA-filter simulator is not available during movie capture. It's also limited for general movie recording because it lacks continuous autofocus in movie mode. You have to focus manually or prefocus and hope your subject doesn't move from the focal plane. Given how noisy the inexpensive Pentax lenses are, I can understand the company forgoing continuous AF. It does have good focus peaking (outlines for in-focus edges), which makes manually focusing relatively easy.Analysis samples Enlarge ImageIn-focus details for JPEG images remain pretty sharp up through ISO 1600. Lori Grunin/CNET Enlarge ImageOnce you pass ISO 1600, though, out-of-focus areas start mushing up quickly; in-focus spots are usable up through ISO 6400. Lori Grunin/CNET window.console && console.log && console.log(\"ADS: queuing leader-plus-middle-554d159c397ec for display\"); var cbsiGptDivIds = cbsiGptDivIds || []; cbsiGptDivIds.push(\"leader-plus-middle-554d159c397ec\"); Enlarge ImageThe K-S2's white-balance and default color settings are generally pretty good. Lori Grunin/CNET Enlarge ImageThe 18-50mm lens renders nicely round out-of-focus highlights, but concentric patterns in the circles are an artifact of the optical design needed to produce a collapsible lens. Lori Grunin/CNET Performance Editors' Note: We haven't tested any comparable cameras since reworking our test methods last summer, so we're not including a comparison chart. It will be included when we test other comparable cameras in the future. I'd rank the K-S2's performance as good -- certainly good enough for the basic \"kids, pets and travel\" photography for which it's intended -- but not better than average. It's a little slow to start up at 1.2 seconds, which is a mirrorless-camera level performance rather than dSLR. it takes about 0.4 second to focus and shoot in good light, which slows to about 0.5 second in dim. Unfortunately, it doesn't always refocus when you press the shutter, and in general the kit lens is a slow mover, so the time it takes to focus depends upon how far out of focus you're starting from. It fares better when it comes to two shots in a row: 0.2 second regardless of whether it's raw or JPEG, which is good. And it only jumps to 0.9 second with flash enabled. Though it's rated at 5.5 frames per second for continuous shooting, I couldn't get it to work that fast with autofocus enabled. With AF -- our normal test conditions -- it maxed out at 4.6fps for about 40 JPEGs and 4.5fps for about 10 raw. With focus fixed on the first frame and a shutter speed of 1/250 second I got it up to 5.4fps. However, 4.6fps should be fine for most burst-shooting situations. The autofocus performance, however, was a bit frustrating. Aside from the aforementioned occasional reluctance to even try to focus, I found that in situations where focus was critical -- most notably during our lab testing -- it was off just a hair. I ended up having to manually focus for best results. It could be the new collapsible kit lens, which, with the exception of the ability to focus fairly close, is pretty disappointing. Or it could be vibration from the thwack of the loud shutter and mirror slap. But in most cases the focus is generally fine and continuous shooting with the 18-135mm lens had a decent hit rate where the panning focus accuracy (manually following bicyclists as they ride through the frame) was good enough for most uses. It does offer expanded-area autofocus, which uses surrounding points as backup when the subject moves off of your selected focus point. The battery life isn't great, either, but that seems to be a trend thanks to the effort to make the bodies smaller. ", "title": "The K-S2 is a solid first-dSLR option if you don't care about video"},
{"url": "http://www.cnet.com/products/sodastream-mix/", "sitename": "Cnet", "datetime": "2015-04-13T10:43:54-0700", "body": " SodaStream SodaStream's carbonation on demand has its appeal, but try to carbonate anything besides water, and you'll soon have an explosive mess splattered across your ceiling. The SodaStream Mix aims to change that, with cloud-powered smarts capable of recalibrating the carbonation process for whatever it is you're trying to add bubbles to -- a potential game-changer for anybody with sparkly dreams of fizzed-up juice, wine, or booze. The Mix was crafted by renowned Swiss designer Yves Béhar, founder of the brand management firm Fuseproject. Not surprisingly, it has plenty of high-end countertop appeal, with a slick-looking black-and-red build, a slim profile and a full-color touchscreen. The Mix is built to accommodate any size SodaStream bottle, with easy, ingredient-specific controls for the intensity and duration of the c